Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x7a8 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0xcbb65): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x3faf9): ../Core/Src/PL_lcd.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x1ec55): C:/Users/sf199/Documents/Mice/Mice_workspace_IDE/normal_mice_3/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 1
    <2b>   DW_AT_encoding    : 6	(signed char)
    <2c>   DW_AT_name        : (indirect string, offset: 0x69054): signed char
 <1><30>: Abbrev Number: 3 (DW_TAG_typedef)
    <31>   DW_AT_name        : (indirect string, offset: 0x3cb6e): __uint8_t
    <35>   DW_AT_decl_file   : 2
    <36>   DW_AT_decl_line   : 43
    <37>   DW_AT_decl_column : 24
    <38>   DW_AT_type        : <0x3c>
 <1><3c>: Abbrev Number: 2 (DW_TAG_base_type)
    <3d>   DW_AT_byte_size   : 1
    <3e>   DW_AT_encoding    : 8	(unsigned char)
    <3f>   DW_AT_name        : (indirect string, offset: 0xca64f): unsigned char
 <1><43>: Abbrev Number: 2 (DW_TAG_base_type)
    <44>   DW_AT_byte_size   : 2
    <45>   DW_AT_encoding    : 5	(signed)
    <46>   DW_AT_name        : (indirect string, offset: 0x9bc0e): short int
 <1><4a>: Abbrev Number: 3 (DW_TAG_typedef)
    <4b>   DW_AT_name        : (indirect string, offset: 0xab228): __uint16_t
    <4f>   DW_AT_decl_file   : 2
    <50>   DW_AT_decl_line   : 57
    <51>   DW_AT_decl_column : 25
    <52>   DW_AT_type        : <0x56>
 <1><56>: Abbrev Number: 2 (DW_TAG_base_type)
    <57>   DW_AT_byte_size   : 2
    <58>   DW_AT_encoding    : 7	(unsigned)
    <59>   DW_AT_name        : (indirect string, offset: 0xc8de3): short unsigned int
 <1><5d>: Abbrev Number: 2 (DW_TAG_base_type)
    <5e>   DW_AT_byte_size   : 4
    <5f>   DW_AT_encoding    : 5	(signed)
    <60>   DW_AT_name        : (indirect string, offset: 0x127b7): long int
 <1><64>: Abbrev Number: 3 (DW_TAG_typedef)
    <65>   DW_AT_name        : (indirect string, offset: 0x85dd8): __uint32_t
    <69>   DW_AT_decl_file   : 2
    <6a>   DW_AT_decl_line   : 79
    <6b>   DW_AT_decl_column : 25
    <6c>   DW_AT_type        : <0x70>
 <1><70>: Abbrev Number: 2 (DW_TAG_base_type)
    <71>   DW_AT_byte_size   : 4
    <72>   DW_AT_encoding    : 7	(unsigned)
    <73>   DW_AT_name        : (indirect string, offset: 0x4fdbb): long unsigned int
 <1><77>: Abbrev Number: 2 (DW_TAG_base_type)
    <78>   DW_AT_byte_size   : 8
    <79>   DW_AT_encoding    : 5	(signed)
    <7a>   DW_AT_name        : (indirect string, offset: 0x5f807): long long int
 <1><7e>: Abbrev Number: 2 (DW_TAG_base_type)
    <7f>   DW_AT_byte_size   : 8
    <80>   DW_AT_encoding    : 7	(unsigned)
    <81>   DW_AT_name        : (indirect string, offset: 0x2b983): long long unsigned int
 <1><85>: Abbrev Number: 4 (DW_TAG_base_type)
    <86>   DW_AT_byte_size   : 4
    <87>   DW_AT_encoding    : 5	(signed)
    <88>   DW_AT_name        : int
 <1><8c>: Abbrev Number: 2 (DW_TAG_base_type)
    <8d>   DW_AT_byte_size   : 4
    <8e>   DW_AT_encoding    : 7	(unsigned)
    <8f>   DW_AT_name        : (indirect string, offset: 0x11ed1): unsigned int
 <1><93>: Abbrev Number: 3 (DW_TAG_typedef)
    <94>   DW_AT_name        : (indirect string, offset: 0x3cb70): uint8_t
    <98>   DW_AT_decl_file   : 3
    <99>   DW_AT_decl_line   : 24
    <9a>   DW_AT_decl_column : 19
    <9b>   DW_AT_type        : <0x30>
 <1><9f>: Abbrev Number: 3 (DW_TAG_typedef)
    <a0>   DW_AT_name        : (indirect string, offset: 0xab22a): uint16_t
    <a4>   DW_AT_decl_file   : 3
    <a5>   DW_AT_decl_line   : 36
    <a6>   DW_AT_decl_column : 20
    <a7>   DW_AT_type        : <0x4a>
 <1><ab>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <ac>   DW_AT_type        : <0x9f>
 <1><b0>: Abbrev Number: 3 (DW_TAG_typedef)
    <b1>   DW_AT_name        : (indirect string, offset: 0x85dda): uint32_t
    <b5>   DW_AT_decl_file   : 3
    <b6>   DW_AT_decl_line   : 48
    <b7>   DW_AT_decl_column : 20
    <b8>   DW_AT_type        : <0x64>
 <1><bc>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <bd>   DW_AT_type        : <0xb0>
 <1><c1>: Abbrev Number: 6 (DW_TAG_structure_type)
    <c2>   DW_AT_byte_size   : 16
    <c3>   DW_AT_decl_file   : 4
    <c4>   DW_AT_decl_line   : 361
    <c6>   DW_AT_decl_column : 9
    <c7>   DW_AT_sibling     : <0x104>
 <2><cb>: Abbrev Number: 7 (DW_TAG_member)
    <cc>   DW_AT_name        : CCR
    <d0>   DW_AT_decl_file   : 4
    <d1>   DW_AT_decl_line   : 363
    <d3>   DW_AT_decl_column : 17
    <d4>   DW_AT_type        : <0xbc>
    <d8>   DW_AT_data_member_location: 0
 <2><d9>: Abbrev Number: 8 (DW_TAG_member)
    <da>   DW_AT_name        : (indirect string, offset: 0x89429): CNDTR
    <de>   DW_AT_decl_file   : 4
    <df>   DW_AT_decl_line   : 364
    <e1>   DW_AT_decl_column : 17
    <e2>   DW_AT_type        : <0xbc>
    <e6>   DW_AT_data_member_location: 4
 <2><e7>: Abbrev Number: 8 (DW_TAG_member)
    <e8>   DW_AT_name        : (indirect string, offset: 0xca81b): CPAR
    <ec>   DW_AT_decl_file   : 4
    <ed>   DW_AT_decl_line   : 365
    <ef>   DW_AT_decl_column : 17
    <f0>   DW_AT_type        : <0xbc>
    <f4>   DW_AT_data_member_location: 8
 <2><f5>: Abbrev Number: 8 (DW_TAG_member)
    <f6>   DW_AT_name        : (indirect string, offset: 0x7425d): CMAR
    <fa>   DW_AT_decl_file   : 4
    <fb>   DW_AT_decl_line   : 366
    <fd>   DW_AT_decl_column : 17
    <fe>   DW_AT_type        : <0xbc>
    <102>   DW_AT_data_member_location: 12
 <2><103>: Abbrev Number: 0
 <1><104>: Abbrev Number: 9 (DW_TAG_typedef)
    <105>   DW_AT_name        : (indirect string, offset: 0xc5a2f): DMA_Channel_TypeDef
    <109>   DW_AT_decl_file   : 4
    <10a>   DW_AT_decl_line   : 367
    <10c>   DW_AT_decl_column : 3
    <10d>   DW_AT_type        : <0xc1>
 <1><111>: Abbrev Number: 6 (DW_TAG_structure_type)
    <112>   DW_AT_byte_size   : 8
    <113>   DW_AT_decl_file   : 4
    <114>   DW_AT_decl_line   : 369
    <116>   DW_AT_decl_column : 9
    <117>   DW_AT_sibling     : <0x138>
 <2><11b>: Abbrev Number: 7 (DW_TAG_member)
    <11c>   DW_AT_name        : ISR
    <120>   DW_AT_decl_file   : 4
    <121>   DW_AT_decl_line   : 371
    <123>   DW_AT_decl_column : 17
    <124>   DW_AT_type        : <0xbc>
    <128>   DW_AT_data_member_location: 0
 <2><129>: Abbrev Number: 8 (DW_TAG_member)
    <12a>   DW_AT_name        : (indirect string, offset: 0x92ca5): IFCR
    <12e>   DW_AT_decl_file   : 4
    <12f>   DW_AT_decl_line   : 372
    <131>   DW_AT_decl_column : 17
    <132>   DW_AT_type        : <0xbc>
    <136>   DW_AT_data_member_location: 4
 <2><137>: Abbrev Number: 0
 <1><138>: Abbrev Number: 9 (DW_TAG_typedef)
    <139>   DW_AT_name        : (indirect string, offset: 0x4bf06): DMA_TypeDef
    <13d>   DW_AT_decl_file   : 4
    <13e>   DW_AT_decl_line   : 373
    <140>   DW_AT_decl_column : 3
    <141>   DW_AT_type        : <0x111>
 <1><145>: Abbrev Number: 6 (DW_TAG_structure_type)
    <146>   DW_AT_byte_size   : 44
    <147>   DW_AT_decl_file   : 4
    <148>   DW_AT_decl_line   : 472
    <14a>   DW_AT_decl_column : 9
    <14b>   DW_AT_sibling     : <0x1ea>
 <2><14f>: Abbrev Number: 7 (DW_TAG_member)
    <150>   DW_AT_name        : CR1
    <154>   DW_AT_decl_file   : 4
    <155>   DW_AT_decl_line   : 474
    <157>   DW_AT_decl_column : 17
    <158>   DW_AT_type        : <0xbc>
    <15c>   DW_AT_data_member_location: 0
 <2><15d>: Abbrev Number: 7 (DW_TAG_member)
    <15e>   DW_AT_name        : CR2
    <162>   DW_AT_decl_file   : 4
    <163>   DW_AT_decl_line   : 475
    <165>   DW_AT_decl_column : 17
    <166>   DW_AT_type        : <0xbc>
    <16a>   DW_AT_data_member_location: 4
 <2><16b>: Abbrev Number: 8 (DW_TAG_member)
    <16c>   DW_AT_name        : (indirect string, offset: 0x1f77b): OAR1
    <170>   DW_AT_decl_file   : 4
    <171>   DW_AT_decl_line   : 476
    <173>   DW_AT_decl_column : 17
    <174>   DW_AT_type        : <0xbc>
    <178>   DW_AT_data_member_location: 8
 <2><179>: Abbrev Number: 8 (DW_TAG_member)
    <17a>   DW_AT_name        : (indirect string, offset: 0x5828e): OAR2
    <17e>   DW_AT_decl_file   : 4
    <17f>   DW_AT_decl_line   : 477
    <181>   DW_AT_decl_column : 17
    <182>   DW_AT_type        : <0xbc>
    <186>   DW_AT_data_member_location: 12
 <2><187>: Abbrev Number: 8 (DW_TAG_member)
    <188>   DW_AT_name        : (indirect string, offset: 0x7b43a): TIMINGR
    <18c>   DW_AT_decl_file   : 4
    <18d>   DW_AT_decl_line   : 478
    <18f>   DW_AT_decl_column : 17
    <190>   DW_AT_type        : <0xbc>
    <194>   DW_AT_data_member_location: 16
 <2><195>: Abbrev Number: 8 (DW_TAG_member)
    <196>   DW_AT_name        : (indirect string, offset: 0xaa8d1): TIMEOUTR
    <19a>   DW_AT_decl_file   : 4
    <19b>   DW_AT_decl_line   : 479
    <19d>   DW_AT_decl_column : 17
    <19e>   DW_AT_type        : <0xbc>
    <1a2>   DW_AT_data_member_location: 20
 <2><1a3>: Abbrev Number: 7 (DW_TAG_member)
    <1a4>   DW_AT_name        : ISR
    <1a8>   DW_AT_decl_file   : 4
    <1a9>   DW_AT_decl_line   : 480
    <1ab>   DW_AT_decl_column : 17
    <1ac>   DW_AT_type        : <0xbc>
    <1b0>   DW_AT_data_member_location: 24
 <2><1b1>: Abbrev Number: 7 (DW_TAG_member)
    <1b2>   DW_AT_name        : ICR
    <1b6>   DW_AT_decl_file   : 4
    <1b7>   DW_AT_decl_line   : 481
    <1b9>   DW_AT_decl_column : 17
    <1ba>   DW_AT_type        : <0xbc>
    <1be>   DW_AT_data_member_location: 28
 <2><1bf>: Abbrev Number: 8 (DW_TAG_member)
    <1c0>   DW_AT_name        : (indirect string, offset: 0xb23ad): PECR
    <1c4>   DW_AT_decl_file   : 4
    <1c5>   DW_AT_decl_line   : 482
    <1c7>   DW_AT_decl_column : 17
    <1c8>   DW_AT_type        : <0xbc>
    <1cc>   DW_AT_data_member_location: 32
 <2><1cd>: Abbrev Number: 8 (DW_TAG_member)
    <1ce>   DW_AT_name        : (indirect string, offset: 0xacf1c): RXDR
    <1d2>   DW_AT_decl_file   : 4
    <1d3>   DW_AT_decl_line   : 483
    <1d5>   DW_AT_decl_column : 17
    <1d6>   DW_AT_type        : <0xbc>
    <1da>   DW_AT_data_member_location: 36
 <2><1db>: Abbrev Number: 8 (DW_TAG_member)
    <1dc>   DW_AT_name        : (indirect string, offset: 0xdb1f3): TXDR
    <1e0>   DW_AT_decl_file   : 4
    <1e1>   DW_AT_decl_line   : 484
    <1e3>   DW_AT_decl_column : 17
    <1e4>   DW_AT_type        : <0xbc>
    <1e8>   DW_AT_data_member_location: 40
 <2><1e9>: Abbrev Number: 0
 <1><1ea>: Abbrev Number: 9 (DW_TAG_typedef)
    <1eb>   DW_AT_name        : (indirect string, offset: 0x1d5d1): I2C_TypeDef
    <1ef>   DW_AT_decl_file   : 4
    <1f0>   DW_AT_decl_line   : 485
    <1f2>   DW_AT_decl_column : 3
    <1f3>   DW_AT_type        : <0x145>
 <1><1f7>: Abbrev Number: 2 (DW_TAG_base_type)
    <1f8>   DW_AT_byte_size   : 8
    <1f9>   DW_AT_encoding    : 4	(float)
    <1fa>   DW_AT_name        : (indirect string, offset: 0xd402a): long double
 <1><1fe>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <1ff>   DW_AT_encoding    : 7	(unsigned)
    <200>   DW_AT_byte_size   : 1
    <201>   DW_AT_type        : <0x3c>
    <205>   DW_AT_decl_file   : 5
    <206>   DW_AT_decl_line   : 40
    <207>   DW_AT_decl_column : 1
    <208>   DW_AT_sibling     : <0x225>
 <2><20c>: Abbrev Number: 11 (DW_TAG_enumerator)
    <20d>   DW_AT_name        : (indirect string, offset: 0x4631d): HAL_OK
    <211>   DW_AT_const_value : 0
 <2><212>: Abbrev Number: 11 (DW_TAG_enumerator)
    <213>   DW_AT_name        : (indirect string, offset: 0x83618): HAL_ERROR
    <217>   DW_AT_const_value : 1
 <2><218>: Abbrev Number: 11 (DW_TAG_enumerator)
    <219>   DW_AT_name        : (indirect string, offset: 0x25084): HAL_BUSY
    <21d>   DW_AT_const_value : 2
 <2><21e>: Abbrev Number: 11 (DW_TAG_enumerator)
    <21f>   DW_AT_name        : (indirect string, offset: 0x3d1bb): HAL_TIMEOUT
    <223>   DW_AT_const_value : 3
 <2><224>: Abbrev Number: 0
 <1><225>: Abbrev Number: 3 (DW_TAG_typedef)
    <226>   DW_AT_name        : (indirect string, offset: 0x2972): HAL_StatusTypeDef
    <22a>   DW_AT_decl_file   : 5
    <22b>   DW_AT_decl_line   : 45
    <22c>   DW_AT_decl_column : 3
    <22d>   DW_AT_type        : <0x1fe>
 <1><231>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <232>   DW_AT_encoding    : 7	(unsigned)
    <233>   DW_AT_byte_size   : 1
    <234>   DW_AT_type        : <0x3c>
    <238>   DW_AT_decl_file   : 5
    <239>   DW_AT_decl_line   : 51
    <23a>   DW_AT_decl_column : 1
    <23b>   DW_AT_sibling     : <0x24c>
 <2><23f>: Abbrev Number: 11 (DW_TAG_enumerator)
    <240>   DW_AT_name        : (indirect string, offset: 0x9ac5b): HAL_UNLOCKED
    <244>   DW_AT_const_value : 0
 <2><245>: Abbrev Number: 11 (DW_TAG_enumerator)
    <246>   DW_AT_name        : (indirect string, offset: 0xd1739): HAL_LOCKED
    <24a>   DW_AT_const_value : 1
 <2><24b>: Abbrev Number: 0
 <1><24c>: Abbrev Number: 3 (DW_TAG_typedef)
    <24d>   DW_AT_name        : (indirect string, offset: 0x7b637): HAL_LockTypeDef
    <251>   DW_AT_decl_file   : 5
    <252>   DW_AT_decl_line   : 54
    <253>   DW_AT_decl_column : 3
    <254>   DW_AT_type        : <0x231>
 <1><258>: Abbrev Number: 12 (DW_TAG_structure_type)
    <259>   DW_AT_byte_size   : 32
    <25a>   DW_AT_decl_file   : 6
    <25b>   DW_AT_decl_line   : 47
    <25c>   DW_AT_decl_column : 9
    <25d>   DW_AT_sibling     : <0x2ca>
 <2><261>: Abbrev Number: 13 (DW_TAG_member)
    <262>   DW_AT_name        : (indirect string, offset: 0xdab2d): Request
    <266>   DW_AT_decl_file   : 6
    <267>   DW_AT_decl_line   : 49
    <268>   DW_AT_decl_column : 12
    <269>   DW_AT_type        : <0xb0>
    <26d>   DW_AT_data_member_location: 0
 <2><26e>: Abbrev Number: 13 (DW_TAG_member)
    <26f>   DW_AT_name        : (indirect string, offset: 0xdb07e): Direction
    <273>   DW_AT_decl_file   : 6
    <274>   DW_AT_decl_line   : 52
    <275>   DW_AT_decl_column : 12
    <276>   DW_AT_type        : <0xb0>
    <27a>   DW_AT_data_member_location: 4
 <2><27b>: Abbrev Number: 13 (DW_TAG_member)
    <27c>   DW_AT_name        : (indirect string, offset: 0xe80e): PeriphInc
    <280>   DW_AT_decl_file   : 6
    <281>   DW_AT_decl_line   : 56
    <282>   DW_AT_decl_column : 12
    <283>   DW_AT_type        : <0xb0>
    <287>   DW_AT_data_member_location: 8
 <2><288>: Abbrev Number: 13 (DW_TAG_member)
    <289>   DW_AT_name        : (indirect string, offset: 0x212fd): MemInc
    <28d>   DW_AT_decl_file   : 6
    <28e>   DW_AT_decl_line   : 59
    <28f>   DW_AT_decl_column : 12
    <290>   DW_AT_type        : <0xb0>
    <294>   DW_AT_data_member_location: 12
 <2><295>: Abbrev Number: 13 (DW_TAG_member)
    <296>   DW_AT_name        : (indirect string, offset: 0x68532): PeriphDataAlignment
    <29a>   DW_AT_decl_file   : 6
    <29b>   DW_AT_decl_line   : 62
    <29c>   DW_AT_decl_column : 12
    <29d>   DW_AT_type        : <0xb0>
    <2a1>   DW_AT_data_member_location: 16
 <2><2a2>: Abbrev Number: 13 (DW_TAG_member)
    <2a3>   DW_AT_name        : (indirect string, offset: 0xbd556): MemDataAlignment
    <2a7>   DW_AT_decl_file   : 6
    <2a8>   DW_AT_decl_line   : 65
    <2a9>   DW_AT_decl_column : 12
    <2aa>   DW_AT_type        : <0xb0>
    <2ae>   DW_AT_data_member_location: 20
 <2><2af>: Abbrev Number: 13 (DW_TAG_member)
    <2b0>   DW_AT_name        : (indirect string, offset: 0xdbace): Mode
    <2b4>   DW_AT_decl_file   : 6
    <2b5>   DW_AT_decl_line   : 68
    <2b6>   DW_AT_decl_column : 12
    <2b7>   DW_AT_type        : <0xb0>
    <2bb>   DW_AT_data_member_location: 24
 <2><2bc>: Abbrev Number: 13 (DW_TAG_member)
    <2bd>   DW_AT_name        : (indirect string, offset: 0xda378): Priority
    <2c1>   DW_AT_decl_file   : 6
    <2c2>   DW_AT_decl_line   : 73
    <2c3>   DW_AT_decl_column : 12
    <2c4>   DW_AT_type        : <0xb0>
    <2c8>   DW_AT_data_member_location: 28
 <2><2c9>: Abbrev Number: 0
 <1><2ca>: Abbrev Number: 3 (DW_TAG_typedef)
    <2cb>   DW_AT_name        : (indirect string, offset: 0x38428): DMA_InitTypeDef
    <2cf>   DW_AT_decl_file   : 6
    <2d0>   DW_AT_decl_line   : 75
    <2d1>   DW_AT_decl_column : 3
    <2d2>   DW_AT_type        : <0x258>
 <1><2d6>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <2d7>   DW_AT_encoding    : 7	(unsigned)
    <2d8>   DW_AT_byte_size   : 1
    <2d9>   DW_AT_type        : <0x3c>
    <2dd>   DW_AT_decl_file   : 6
    <2de>   DW_AT_decl_line   : 81
    <2df>   DW_AT_decl_column : 1
    <2e0>   DW_AT_sibling     : <0x2fd>
 <2><2e4>: Abbrev Number: 11 (DW_TAG_enumerator)
    <2e5>   DW_AT_name        : (indirect string, offset: 0x9bf65): HAL_DMA_STATE_RESET
    <2e9>   DW_AT_const_value : 0
 <2><2ea>: Abbrev Number: 11 (DW_TAG_enumerator)
    <2eb>   DW_AT_name        : (indirect string, offset: 0x396cb): HAL_DMA_STATE_READY
    <2ef>   DW_AT_const_value : 1
 <2><2f0>: Abbrev Number: 11 (DW_TAG_enumerator)
    <2f1>   DW_AT_name        : (indirect string, offset: 0x91557): HAL_DMA_STATE_BUSY
    <2f5>   DW_AT_const_value : 2
 <2><2f6>: Abbrev Number: 11 (DW_TAG_enumerator)
    <2f7>   DW_AT_name        : (indirect string, offset: 0xce420): HAL_DMA_STATE_TIMEOUT
    <2fb>   DW_AT_const_value : 3
 <2><2fc>: Abbrev Number: 0
 <1><2fd>: Abbrev Number: 3 (DW_TAG_typedef)
    <2fe>   DW_AT_name        : (indirect string, offset: 0x73a1a): HAL_DMA_StateTypeDef
    <302>   DW_AT_decl_file   : 6
    <303>   DW_AT_decl_line   : 86
    <304>   DW_AT_decl_column : 2
    <305>   DW_AT_type        : <0x2d6>
 <1><309>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <30a>   DW_AT_type        : <0x2fd>
 <1><30e>: Abbrev Number: 14 (DW_TAG_structure_type)
    <30f>   DW_AT_name        : (indirect string, offset: 0xb251a): __DMA_HandleTypeDef
    <313>   DW_AT_byte_size   : 72
    <314>   DW_AT_decl_file   : 6
    <315>   DW_AT_decl_line   : 113
    <316>   DW_AT_decl_column : 16
    <317>   DW_AT_sibling     : <0x3b8>
 <2><31b>: Abbrev Number: 13 (DW_TAG_member)
    <31c>   DW_AT_name        : (indirect string, offset: 0xaaf8c): Instance
    <320>   DW_AT_decl_file   : 6
    <321>   DW_AT_decl_line   : 115
    <322>   DW_AT_decl_column : 27
    <323>   DW_AT_type        : <0x3b8>
    <327>   DW_AT_data_member_location: 0
 <2><328>: Abbrev Number: 13 (DW_TAG_member)
    <329>   DW_AT_name        : (indirect string, offset: 0xdc3cc): Init
    <32d>   DW_AT_decl_file   : 6
    <32e>   DW_AT_decl_line   : 117
    <32f>   DW_AT_decl_column : 25
    <330>   DW_AT_type        : <0x2ca>
    <334>   DW_AT_data_member_location: 4
 <2><335>: Abbrev Number: 13 (DW_TAG_member)
    <336>   DW_AT_name        : (indirect string, offset: 0x95373): Lock
    <33a>   DW_AT_decl_file   : 6
    <33b>   DW_AT_decl_line   : 119
    <33c>   DW_AT_decl_column : 25
    <33d>   DW_AT_type        : <0x24c>
    <341>   DW_AT_data_member_location: 36
 <2><342>: Abbrev Number: 13 (DW_TAG_member)
    <343>   DW_AT_name        : (indirect string, offset: 0xd9131): State
    <347>   DW_AT_decl_file   : 6
    <348>   DW_AT_decl_line   : 121
    <349>   DW_AT_decl_column : 30
    <34a>   DW_AT_type        : <0x309>
    <34e>   DW_AT_data_member_location: 37
 <2><34f>: Abbrev Number: 13 (DW_TAG_member)
    <350>   DW_AT_name        : (indirect string, offset: 0xc76bd): Parent
    <354>   DW_AT_decl_file   : 6
    <355>   DW_AT_decl_line   : 123
    <356>   DW_AT_decl_column : 26
    <357>   DW_AT_type        : <0x3be>
    <35b>   DW_AT_data_member_location: 40
 <2><35c>: Abbrev Number: 13 (DW_TAG_member)
    <35d>   DW_AT_name        : (indirect string, offset: 0xd0a80): XferCpltCallback
    <361>   DW_AT_decl_file   : 6
    <362>   DW_AT_decl_line   : 125
    <363>   DW_AT_decl_column : 28
    <364>   DW_AT_type        : <0x3d1>
    <368>   DW_AT_data_member_location: 44
 <2><369>: Abbrev Number: 13 (DW_TAG_member)
    <36a>   DW_AT_name        : (indirect string, offset: 0xa2cc0): XferHalfCpltCallback
    <36e>   DW_AT_decl_file   : 6
    <36f>   DW_AT_decl_line   : 127
    <370>   DW_AT_decl_column : 28
    <371>   DW_AT_type        : <0x3d1>
    <375>   DW_AT_data_member_location: 48
 <2><376>: Abbrev Number: 13 (DW_TAG_member)
    <377>   DW_AT_name        : (indirect string, offset: 0x1ea33): XferErrorCallback
    <37b>   DW_AT_decl_file   : 6
    <37c>   DW_AT_decl_line   : 129
    <37d>   DW_AT_decl_column : 28
    <37e>   DW_AT_type        : <0x3d1>
    <382>   DW_AT_data_member_location: 52
 <2><383>: Abbrev Number: 13 (DW_TAG_member)
    <384>   DW_AT_name        : (indirect string, offset: 0xc36a6): XferAbortCallback
    <388>   DW_AT_decl_file   : 6
    <389>   DW_AT_decl_line   : 131
    <38a>   DW_AT_decl_column : 28
    <38b>   DW_AT_type        : <0x3d1>
    <38f>   DW_AT_data_member_location: 56
 <2><390>: Abbrev Number: 13 (DW_TAG_member)
    <391>   DW_AT_name        : (indirect string, offset: 0xcd034): ErrorCode
    <395>   DW_AT_decl_file   : 6
    <396>   DW_AT_decl_line   : 133
    <397>   DW_AT_decl_column : 25
    <398>   DW_AT_type        : <0xbc>
    <39c>   DW_AT_data_member_location: 60
 <2><39d>: Abbrev Number: 13 (DW_TAG_member)
    <39e>   DW_AT_name        : (indirect string, offset: 0x5498a): DmaBaseAddress
    <3a2>   DW_AT_decl_file   : 6
    <3a3>   DW_AT_decl_line   : 135
    <3a4>   DW_AT_decl_column : 26
    <3a5>   DW_AT_type        : <0x3d7>
    <3a9>   DW_AT_data_member_location: 64
 <2><3aa>: Abbrev Number: 13 (DW_TAG_member)
    <3ab>   DW_AT_name        : (indirect string, offset: 0xe785): ChannelIndex
    <3af>   DW_AT_decl_file   : 6
    <3b0>   DW_AT_decl_line   : 137
    <3b1>   DW_AT_decl_column : 25
    <3b2>   DW_AT_type        : <0xb0>
    <3b6>   DW_AT_data_member_location: 68
 <2><3b7>: Abbrev Number: 0
 <1><3b8>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <3b9>   DW_AT_byte_size   : 4
    <3ba>   DW_AT_type        : <0x104>
 <1><3be>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <3bf>   DW_AT_byte_size   : 4
 <1><3c0>: Abbrev Number: 17 (DW_TAG_subroutine_type)
    <3c1>   DW_AT_prototyped  : 1
    <3c1>   DW_AT_sibling     : <0x3cb>
 <2><3c5>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <3c6>   DW_AT_type        : <0x3cb>
 <2><3ca>: Abbrev Number: 0
 <1><3cb>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <3cc>   DW_AT_byte_size   : 4
    <3cd>   DW_AT_type        : <0x30e>
 <1><3d1>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <3d2>   DW_AT_byte_size   : 4
    <3d3>   DW_AT_type        : <0x3c0>
 <1><3d7>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <3d8>   DW_AT_byte_size   : 4
    <3d9>   DW_AT_type        : <0x138>
 <1><3dd>: Abbrev Number: 3 (DW_TAG_typedef)
    <3de>   DW_AT_name        : (indirect string, offset: 0xb251c): DMA_HandleTypeDef
    <3e2>   DW_AT_decl_file   : 6
    <3e3>   DW_AT_decl_line   : 154
    <3e4>   DW_AT_decl_column : 2
    <3e5>   DW_AT_type        : <0x30e>
 <1><3e9>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <3ea>   DW_AT_byte_size   : 4
    <3eb>   DW_AT_type        : <0x3dd>
 <1><3ef>: Abbrev Number: 12 (DW_TAG_structure_type)
    <3f0>   DW_AT_byte_size   : 32
    <3f1>   DW_AT_decl_file   : 7
    <3f2>   DW_AT_decl_line   : 48
    <3f3>   DW_AT_decl_column : 9
    <3f4>   DW_AT_sibling     : <0x461>
 <2><3f8>: Abbrev Number: 13 (DW_TAG_member)
    <3f9>   DW_AT_name        : (indirect string, offset: 0xbe527): Timing
    <3fd>   DW_AT_decl_file   : 7
    <3fe>   DW_AT_decl_line   : 50
    <3ff>   DW_AT_decl_column : 12
    <400>   DW_AT_type        : <0xb0>
    <404>   DW_AT_data_member_location: 0
 <2><405>: Abbrev Number: 13 (DW_TAG_member)
    <406>   DW_AT_name        : (indirect string, offset: 0x4b27a): OwnAddress1
    <40a>   DW_AT_decl_file   : 7
    <40b>   DW_AT_decl_line   : 54
    <40c>   DW_AT_decl_column : 12
    <40d>   DW_AT_type        : <0xb0>
    <411>   DW_AT_data_member_location: 4
 <2><412>: Abbrev Number: 13 (DW_TAG_member)
    <413>   DW_AT_name        : (indirect string, offset: 0x58d42): AddressingMode
    <417>   DW_AT_decl_file   : 7
    <418>   DW_AT_decl_line   : 57
    <419>   DW_AT_decl_column : 12
    <41a>   DW_AT_type        : <0xb0>
    <41e>   DW_AT_data_member_location: 8
 <2><41f>: Abbrev Number: 13 (DW_TAG_member)
    <420>   DW_AT_name        : (indirect string, offset: 0x9675e): DualAddressMode
    <424>   DW_AT_decl_file   : 7
    <425>   DW_AT_decl_line   : 60
    <426>   DW_AT_decl_column : 12
    <427>   DW_AT_type        : <0xb0>
    <42b>   DW_AT_data_member_location: 12
 <2><42c>: Abbrev Number: 13 (DW_TAG_member)
    <42d>   DW_AT_name        : (indirect string, offset: 0x4b286): OwnAddress2
    <431>   DW_AT_decl_file   : 7
    <432>   DW_AT_decl_line   : 63
    <433>   DW_AT_decl_column : 12
    <434>   DW_AT_type        : <0xb0>
    <438>   DW_AT_data_member_location: 16
 <2><439>: Abbrev Number: 13 (DW_TAG_member)
    <43a>   DW_AT_name        : (indirect string, offset: 0x5a27e): OwnAddress2Masks
    <43e>   DW_AT_decl_file   : 7
    <43f>   DW_AT_decl_line   : 66
    <440>   DW_AT_decl_column : 12
    <441>   DW_AT_type        : <0xb0>
    <445>   DW_AT_data_member_location: 20
 <2><446>: Abbrev Number: 13 (DW_TAG_member)
    <447>   DW_AT_name        : (indirect string, offset: 0x225d1): GeneralCallMode
    <44b>   DW_AT_decl_file   : 7
    <44c>   DW_AT_decl_line   : 69
    <44d>   DW_AT_decl_column : 12
    <44e>   DW_AT_type        : <0xb0>
    <452>   DW_AT_data_member_location: 24
 <2><453>: Abbrev Number: 13 (DW_TAG_member)
    <454>   DW_AT_name        : (indirect string, offset: 0x40012): NoStretchMode
    <458>   DW_AT_decl_file   : 7
    <459>   DW_AT_decl_line   : 72
    <45a>   DW_AT_decl_column : 12
    <45b>   DW_AT_type        : <0xb0>
    <45f>   DW_AT_data_member_location: 28
 <2><460>: Abbrev Number: 0
 <1><461>: Abbrev Number: 3 (DW_TAG_typedef)
    <462>   DW_AT_name        : (indirect string, offset: 0x42530): I2C_InitTypeDef
    <466>   DW_AT_decl_file   : 7
    <467>   DW_AT_decl_line   : 75
    <468>   DW_AT_decl_column : 3
    <469>   DW_AT_type        : <0x3ef>
 <1><46d>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <46e>   DW_AT_encoding    : 7	(unsigned)
    <46f>   DW_AT_byte_size   : 1
    <470>   DW_AT_type        : <0x3c>
    <474>   DW_AT_decl_file   : 7
    <475>   DW_AT_decl_line   : 109
    <476>   DW_AT_decl_column : 1
    <477>   DW_AT_sibling     : <0x4be>
 <2><47b>: Abbrev Number: 11 (DW_TAG_enumerator)
    <47c>   DW_AT_name        : (indirect string, offset: 0x41999): HAL_I2C_STATE_RESET
    <480>   DW_AT_const_value : 0
 <2><481>: Abbrev Number: 11 (DW_TAG_enumerator)
    <482>   DW_AT_name        : (indirect string, offset: 0x43555): HAL_I2C_STATE_READY
    <486>   DW_AT_const_value : 32
 <2><487>: Abbrev Number: 11 (DW_TAG_enumerator)
    <488>   DW_AT_name        : (indirect string, offset: 0x3c79c): HAL_I2C_STATE_BUSY
    <48c>   DW_AT_const_value : 36
 <2><48d>: Abbrev Number: 11 (DW_TAG_enumerator)
    <48e>   DW_AT_name        : (indirect string, offset: 0xc67d8): HAL_I2C_STATE_BUSY_TX
    <492>   DW_AT_const_value : 33
 <2><493>: Abbrev Number: 11 (DW_TAG_enumerator)
    <494>   DW_AT_name        : (indirect string, offset: 0x1399b): HAL_I2C_STATE_BUSY_RX
    <498>   DW_AT_const_value : 34
 <2><499>: Abbrev Number: 11 (DW_TAG_enumerator)
    <49a>   DW_AT_name        : (indirect string, offset: 0x527f2): HAL_I2C_STATE_LISTEN
    <49e>   DW_AT_const_value : 40
 <2><49f>: Abbrev Number: 11 (DW_TAG_enumerator)
    <4a0>   DW_AT_name        : (indirect string, offset: 0x32374): HAL_I2C_STATE_BUSY_TX_LISTEN
    <4a4>   DW_AT_const_value : 41
 <2><4a5>: Abbrev Number: 11 (DW_TAG_enumerator)
    <4a6>   DW_AT_name        : (indirect string, offset: 0x90bed): HAL_I2C_STATE_BUSY_RX_LISTEN
    <4aa>   DW_AT_const_value : 42
 <2><4ab>: Abbrev Number: 11 (DW_TAG_enumerator)
    <4ac>   DW_AT_name        : (indirect string, offset: 0x39ac6): HAL_I2C_STATE_ABORT
    <4b0>   DW_AT_const_value : 96
 <2><4b1>: Abbrev Number: 11 (DW_TAG_enumerator)
    <4b2>   DW_AT_name        : (indirect string, offset: 0xaef8b): HAL_I2C_STATE_TIMEOUT
    <4b6>   DW_AT_const_value : 160
 <2><4b7>: Abbrev Number: 11 (DW_TAG_enumerator)
    <4b8>   DW_AT_name        : (indirect string, offset: 0xbde8c): HAL_I2C_STATE_ERROR
    <4bc>   DW_AT_const_value : 224
 <2><4bd>: Abbrev Number: 0
 <1><4be>: Abbrev Number: 3 (DW_TAG_typedef)
    <4bf>   DW_AT_name        : (indirect string, offset: 0x23448): HAL_I2C_StateTypeDef
    <4c3>   DW_AT_decl_file   : 7
    <4c4>   DW_AT_decl_line   : 124
    <4c5>   DW_AT_decl_column : 3
    <4c6>   DW_AT_type        : <0x46d>
 <1><4ca>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <4cb>   DW_AT_type        : <0x4be>
 <1><4cf>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <4d0>   DW_AT_encoding    : 7	(unsigned)
    <4d1>   DW_AT_byte_size   : 1
    <4d2>   DW_AT_type        : <0x3c>
    <4d6>   DW_AT_decl_file   : 7
    <4d7>   DW_AT_decl_line   : 149
    <4d8>   DW_AT_decl_column : 1
    <4d9>   DW_AT_sibling     : <0x4f6>
 <2><4dd>: Abbrev Number: 11 (DW_TAG_enumerator)
    <4de>   DW_AT_name        : (indirect string, offset: 0x36dac): HAL_I2C_MODE_NONE
    <4e2>   DW_AT_const_value : 0
 <2><4e3>: Abbrev Number: 11 (DW_TAG_enumerator)
    <4e4>   DW_AT_name        : (indirect string, offset: 0x70007): HAL_I2C_MODE_MASTER
    <4e8>   DW_AT_const_value : 16
 <2><4e9>: Abbrev Number: 11 (DW_TAG_enumerator)
    <4ea>   DW_AT_name        : (indirect string, offset: 0x68b86): HAL_I2C_MODE_SLAVE
    <4ee>   DW_AT_const_value : 32
 <2><4ef>: Abbrev Number: 11 (DW_TAG_enumerator)
    <4f0>   DW_AT_name        : (indirect string, offset: 0x41d83): HAL_I2C_MODE_MEM
    <4f4>   DW_AT_const_value : 64
 <2><4f5>: Abbrev Number: 0
 <1><4f6>: Abbrev Number: 3 (DW_TAG_typedef)
    <4f7>   DW_AT_name        : (indirect string, offset: 0x657a7): HAL_I2C_ModeTypeDef
    <4fb>   DW_AT_decl_file   : 7
    <4fc>   DW_AT_decl_line   : 155
    <4fd>   DW_AT_decl_column : 3
    <4fe>   DW_AT_type        : <0x4cf>
 <1><502>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <503>   DW_AT_type        : <0x4f6>
 <1><507>: Abbrev Number: 14 (DW_TAG_structure_type)
    <508>   DW_AT_name        : (indirect string, offset: 0x1664d): __I2C_HandleTypeDef
    <50c>   DW_AT_byte_size   : 76
    <50d>   DW_AT_decl_file   : 7
    <50e>   DW_AT_decl_line   : 186
    <50f>   DW_AT_decl_column : 16
    <510>   DW_AT_sibling     : <0x5d8>
 <2><514>: Abbrev Number: 13 (DW_TAG_member)
    <515>   DW_AT_name        : (indirect string, offset: 0xaaf8c): Instance
    <519>   DW_AT_decl_file   : 7
    <51a>   DW_AT_decl_line   : 188
    <51b>   DW_AT_decl_column : 31
    <51c>   DW_AT_type        : <0x5d8>
    <520>   DW_AT_data_member_location: 0
 <2><521>: Abbrev Number: 13 (DW_TAG_member)
    <522>   DW_AT_name        : (indirect string, offset: 0xdc3cc): Init
    <526>   DW_AT_decl_file   : 7
    <527>   DW_AT_decl_line   : 190
    <528>   DW_AT_decl_column : 30
    <529>   DW_AT_type        : <0x461>
    <52d>   DW_AT_data_member_location: 4
 <2><52e>: Abbrev Number: 13 (DW_TAG_member)
    <52f>   DW_AT_name        : (indirect string, offset: 0x148c1): pBuffPtr
    <533>   DW_AT_decl_file   : 7
    <534>   DW_AT_decl_line   : 192
    <535>   DW_AT_decl_column : 31
    <536>   DW_AT_type        : <0x5de>
    <53a>   DW_AT_data_member_location: 36
 <2><53b>: Abbrev Number: 13 (DW_TAG_member)
    <53c>   DW_AT_name        : (indirect string, offset: 0xd6879): XferSize
    <540>   DW_AT_decl_file   : 7
    <541>   DW_AT_decl_line   : 194
    <542>   DW_AT_decl_column : 30
    <543>   DW_AT_type        : <0x9f>
    <547>   DW_AT_data_member_location: 40
 <2><548>: Abbrev Number: 13 (DW_TAG_member)
    <549>   DW_AT_name        : (indirect string, offset: 0xd6c4d): XferCount
    <54d>   DW_AT_decl_file   : 7
    <54e>   DW_AT_decl_line   : 196
    <54f>   DW_AT_decl_column : 30
    <550>   DW_AT_type        : <0xab>
    <554>   DW_AT_data_member_location: 42
 <2><555>: Abbrev Number: 13 (DW_TAG_member)
    <556>   DW_AT_name        : (indirect string, offset: 0xdab4a): XferOptions
    <55a>   DW_AT_decl_file   : 7
    <55b>   DW_AT_decl_line   : 198
    <55c>   DW_AT_decl_column : 30
    <55d>   DW_AT_type        : <0xbc>
    <561>   DW_AT_data_member_location: 44
 <2><562>: Abbrev Number: 13 (DW_TAG_member)
    <563>   DW_AT_name        : (indirect string, offset: 0x5cbdd): PreviousState
    <567>   DW_AT_decl_file   : 7
    <568>   DW_AT_decl_line   : 201
    <569>   DW_AT_decl_column : 30
    <56a>   DW_AT_type        : <0xbc>
    <56e>   DW_AT_data_member_location: 48
 <2><56f>: Abbrev Number: 13 (DW_TAG_member)
    <570>   DW_AT_name        : (indirect string, offset: 0x77c0f): XferISR
    <574>   DW_AT_decl_file   : 7
    <575>   DW_AT_decl_line   : 203
    <576>   DW_AT_decl_column : 22
    <577>   DW_AT_type        : <0x603>
    <57b>   DW_AT_data_member_location: 52
 <2><57c>: Abbrev Number: 13 (DW_TAG_member)
    <57d>   DW_AT_name        : (indirect string, offset: 0xabe70): hdmatx
    <581>   DW_AT_decl_file   : 7
    <582>   DW_AT_decl_line   : 205
    <583>   DW_AT_decl_column : 31
    <584>   DW_AT_type        : <0x3e9>
    <588>   DW_AT_data_member_location: 56
 <2><589>: Abbrev Number: 13 (DW_TAG_member)
    <58a>   DW_AT_name        : (indirect string, offset: 0xcb6f4): hdmarx
    <58e>   DW_AT_decl_file   : 7
    <58f>   DW_AT_decl_line   : 207
    <590>   DW_AT_decl_column : 31
    <591>   DW_AT_type        : <0x3e9>
    <595>   DW_AT_data_member_location: 60
 <2><596>: Abbrev Number: 13 (DW_TAG_member)
    <597>   DW_AT_name        : (indirect string, offset: 0x95373): Lock
    <59b>   DW_AT_decl_file   : 7
    <59c>   DW_AT_decl_line   : 209
    <59d>   DW_AT_decl_column : 30
    <59e>   DW_AT_type        : <0x24c>
    <5a2>   DW_AT_data_member_location: 64
 <2><5a3>: Abbrev Number: 13 (DW_TAG_member)
    <5a4>   DW_AT_name        : (indirect string, offset: 0xd9131): State
    <5a8>   DW_AT_decl_file   : 7
    <5a9>   DW_AT_decl_line   : 211
    <5aa>   DW_AT_decl_column : 30
    <5ab>   DW_AT_type        : <0x4ca>
    <5af>   DW_AT_data_member_location: 65
 <2><5b0>: Abbrev Number: 13 (DW_TAG_member)
    <5b1>   DW_AT_name        : (indirect string, offset: 0xdbace): Mode
    <5b5>   DW_AT_decl_file   : 7
    <5b6>   DW_AT_decl_line   : 213
    <5b7>   DW_AT_decl_column : 30
    <5b8>   DW_AT_type        : <0x502>
    <5bc>   DW_AT_data_member_location: 66
 <2><5bd>: Abbrev Number: 13 (DW_TAG_member)
    <5be>   DW_AT_name        : (indirect string, offset: 0xcd034): ErrorCode
    <5c2>   DW_AT_decl_file   : 7
    <5c3>   DW_AT_decl_line   : 215
    <5c4>   DW_AT_decl_column : 30
    <5c5>   DW_AT_type        : <0xbc>
    <5c9>   DW_AT_data_member_location: 68
 <2><5ca>: Abbrev Number: 13 (DW_TAG_member)
    <5cb>   DW_AT_name        : (indirect string, offset: 0xb03a): AddrEventCount
    <5cf>   DW_AT_decl_file   : 7
    <5d0>   DW_AT_decl_line   : 217
    <5d1>   DW_AT_decl_column : 30
    <5d2>   DW_AT_type        : <0xbc>
    <5d6>   DW_AT_data_member_location: 72
 <2><5d7>: Abbrev Number: 0
 <1><5d8>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <5d9>   DW_AT_byte_size   : 4
    <5da>   DW_AT_type        : <0x1ea>
 <1><5de>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <5df>   DW_AT_byte_size   : 4
    <5e0>   DW_AT_type        : <0x93>
 <1><5e4>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <5e5>   DW_AT_prototyped  : 1
    <5e5>   DW_AT_type        : <0x225>
    <5e9>   DW_AT_sibling     : <0x5fd>
 <2><5ed>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <5ee>   DW_AT_type        : <0x5fd>
 <2><5f2>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <5f3>   DW_AT_type        : <0xb0>
 <2><5f7>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <5f8>   DW_AT_type        : <0xb0>
 <2><5fc>: Abbrev Number: 0
 <1><5fd>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <5fe>   DW_AT_byte_size   : 4
    <5ff>   DW_AT_type        : <0x507>
 <1><603>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <604>   DW_AT_byte_size   : 4
    <605>   DW_AT_type        : <0x5e4>
 <1><609>: Abbrev Number: 3 (DW_TAG_typedef)
    <60a>   DW_AT_name        : (indirect string, offset: 0x1664f): I2C_HandleTypeDef
    <60e>   DW_AT_decl_file   : 7
    <60f>   DW_AT_decl_line   : 236
    <610>   DW_AT_decl_column : 3
    <611>   DW_AT_type        : <0x507>
 <1><615>: Abbrev Number: 20 (DW_TAG_variable)
    <616>   DW_AT_name        : (indirect string, offset: 0x5ea7): hi2c1
    <61a>   DW_AT_decl_file   : 8
    <61b>   DW_AT_decl_line   : 35
    <61c>   DW_AT_decl_column : 26
    <61d>   DW_AT_type        : <0x609>
    <621>   DW_AT_external    : 1
    <621>   DW_AT_declaration : 1
 <1><621>: Abbrev Number: 21 (DW_TAG_subprogram)
    <622>   DW_AT_external    : 1
    <622>   DW_AT_name        : (indirect string, offset: 0x532f1): HAL_Delay
    <626>   DW_AT_decl_file   : 9
    <627>   DW_AT_decl_line   : 653
    <629>   DW_AT_decl_column : 20
    <62a>   DW_AT_prototyped  : 1
    <62a>   DW_AT_declaration : 1
    <62a>   DW_AT_sibling     : <0x634>
 <2><62e>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <62f>   DW_AT_type        : <0xb0>
 <2><633>: Abbrev Number: 0
 <1><634>: Abbrev Number: 22 (DW_TAG_subprogram)
    <635>   DW_AT_external    : 1
    <635>   DW_AT_name        : (indirect string, offset: 0x4ffeb): HAL_I2C_Master_Transmit
    <639>   DW_AT_decl_file   : 7
    <63a>   DW_AT_decl_line   : 604
    <63c>   DW_AT_decl_column : 19
    <63d>   DW_AT_prototyped  : 1
    <63d>   DW_AT_type        : <0x225>
    <641>   DW_AT_declaration : 1
    <641>   DW_AT_sibling     : <0x65f>
 <2><645>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <646>   DW_AT_type        : <0x65f>
 <2><64a>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <64b>   DW_AT_type        : <0x9f>
 <2><64f>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <650>   DW_AT_type        : <0x5de>
 <2><654>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <655>   DW_AT_type        : <0x9f>
 <2><659>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <65a>   DW_AT_type        : <0xb0>
 <2><65e>: Abbrev Number: 0
 <1><65f>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <660>   DW_AT_byte_size   : 4
    <661>   DW_AT_type        : <0x609>
 <1><665>: Abbrev Number: 23 (DW_TAG_subprogram)
    <666>   DW_AT_external    : 1
    <666>   DW_AT_name        : (indirect string, offset: 0x5c8be): Error_Handler
    <66a>   DW_AT_decl_file   : 10
    <66b>   DW_AT_decl_line   : 53
    <66c>   DW_AT_decl_column : 6
    <66d>   DW_AT_prototyped  : 1
    <66d>   DW_AT_declaration : 1
 <1><66d>: Abbrev Number: 22 (DW_TAG_subprogram)
    <66e>   DW_AT_external    : 1
    <66e>   DW_AT_name        : (indirect string, offset: 0x44c63): HAL_I2C_GetError
    <672>   DW_AT_decl_file   : 7
    <673>   DW_AT_decl_line   : 691
    <675>   DW_AT_decl_column : 22
    <676>   DW_AT_prototyped  : 1
    <676>   DW_AT_type        : <0xb0>
    <67a>   DW_AT_declaration : 1
    <67a>   DW_AT_sibling     : <0x684>
 <2><67e>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <67f>   DW_AT_type        : <0x65f>
 <2><683>: Abbrev Number: 0
 <1><684>: Abbrev Number: 24 (DW_TAG_subprogram)
    <685>   DW_AT_external    : 1
    <685>   DW_AT_name        : (indirect string, offset: 0x10bd): lcd_clear
    <689>   DW_AT_decl_file   : 1
    <68a>   DW_AT_decl_line   : 66
    <68b>   DW_AT_decl_column : 6
    <68c>   DW_AT_low_pc      : 0x8001090
    <690>   DW_AT_high_pc     : 0xe
    <694>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <696>   DW_AT_GNU_all_tail_call_sites: 1
 <1><696>: Abbrev Number: 25 (DW_TAG_subprogram)
    <697>   DW_AT_external    : 1
    <697>   DW_AT_name        : (indirect string, offset: 0x232c1): lcd_pos
    <69b>   DW_AT_decl_file   : 1
    <69c>   DW_AT_decl_line   : 62
    <69d>   DW_AT_decl_column : 6
    <69e>   DW_AT_prototyped  : 1
    <69e>   DW_AT_low_pc      : 0x800105a
    <6a2>   DW_AT_high_pc     : 0x36
    <6a6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <6a8>   DW_AT_GNU_all_tail_call_sites: 1
    <6a8>   DW_AT_sibling     : <0x6cb>
 <2><6ac>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <6ad>   DW_AT_name        : raw
    <6b1>   DW_AT_decl_file   : 1
    <6b2>   DW_AT_decl_line   : 62
    <6b3>   DW_AT_decl_column : 22
    <6b4>   DW_AT_type        : <0x93>
    <6b8>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><6bb>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <6bc>   DW_AT_name        : col
    <6c0>   DW_AT_decl_file   : 1
    <6c1>   DW_AT_decl_line   : 62
    <6c2>   DW_AT_decl_column : 35
    <6c3>   DW_AT_type        : <0x93>
    <6c7>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><6ca>: Abbrev Number: 0
 <1><6cb>: Abbrev Number: 25 (DW_TAG_subprogram)
    <6cc>   DW_AT_external    : 1
    <6cc>   DW_AT_name        : (indirect string, offset: 0x7573a): lcd_move
    <6d0>   DW_AT_decl_file   : 1
    <6d1>   DW_AT_decl_line   : 58
    <6d2>   DW_AT_decl_column : 6
    <6d3>   DW_AT_prototyped  : 1
    <6d3>   DW_AT_low_pc      : 0x0
    <6d7>   DW_AT_high_pc     : 0x20
    <6db>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <6dd>   DW_AT_GNU_all_tail_call_sites: 1
    <6dd>   DW_AT_sibling     : <0x6f1>
 <2><6e1>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <6e2>   DW_AT_name        : pos
    <6e6>   DW_AT_decl_file   : 1
    <6e7>   DW_AT_decl_line   : 58
    <6e8>   DW_AT_decl_column : 23
    <6e9>   DW_AT_type        : <0x93>
    <6ed>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><6f0>: Abbrev Number: 0
 <1><6f1>: Abbrev Number: 27 (DW_TAG_subprogram)
    <6f2>   DW_AT_external    : 1
    <6f2>   DW_AT_name        : (indirect string, offset: 0xbc0ba): lcd_init
    <6f6>   DW_AT_decl_file   : 1
    <6f7>   DW_AT_decl_line   : 42
    <6f8>   DW_AT_decl_column : 6
    <6f9>   DW_AT_prototyped  : 1
    <6f9>   DW_AT_low_pc      : 0x800100e
    <6fd>   DW_AT_high_pc     : 0x4c
    <701>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <703>   DW_AT_GNU_all_tail_call_sites: 1
 <1><703>: Abbrev Number: 25 (DW_TAG_subprogram)
    <704>   DW_AT_external    : 1
    <704>   DW_AT_name        : (indirect string, offset: 0x3ed08): lcd_puts
    <708>   DW_AT_decl_file   : 1
    <709>   DW_AT_decl_line   : 35
    <70a>   DW_AT_decl_column : 6
    <70b>   DW_AT_prototyped  : 1
    <70b>   DW_AT_low_pc      : 0x8000fe4
    <70f>   DW_AT_high_pc     : 0x2a
    <713>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <715>   DW_AT_GNU_all_tail_call_sites: 1
    <715>   DW_AT_sibling     : <0x727>
 <2><719>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <71a>   DW_AT_name        : s
    <71c>   DW_AT_decl_file   : 1
    <71d>   DW_AT_decl_line   : 35
    <71e>   DW_AT_decl_column : 27
    <71f>   DW_AT_type        : <0x727>
    <723>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><726>: Abbrev Number: 0
 <1><727>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <728>   DW_AT_byte_size   : 4
    <729>   DW_AT_type        : <0x734>
 <1><72d>: Abbrev Number: 2 (DW_TAG_base_type)
    <72e>   DW_AT_byte_size   : 1
    <72f>   DW_AT_encoding    : 8	(unsigned char)
    <730>   DW_AT_name        : (indirect string, offset: 0x6905b): char
 <1><734>: Abbrev Number: 28 (DW_TAG_const_type)
    <735>   DW_AT_type        : <0x72d>
 <1><739>: Abbrev Number: 25 (DW_TAG_subprogram)
    <73a>   DW_AT_external    : 1
    <73a>   DW_AT_name        : (indirect string, offset: 0x2d05c): lcd_data
    <73e>   DW_AT_decl_file   : 1
    <73f>   DW_AT_decl_line   : 24
    <740>   DW_AT_decl_column : 6
    <741>   DW_AT_prototyped  : 1
    <741>   DW_AT_low_pc      : 0x8000f98
    <745>   DW_AT_high_pc     : 0x4c
    <749>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <74b>   DW_AT_GNU_all_tail_call_sites: 1
    <74b>   DW_AT_sibling     : <0x76c>
 <2><74f>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <750>   DW_AT_name        : x
    <752>   DW_AT_decl_file   : 1
    <753>   DW_AT_decl_line   : 24
    <754>   DW_AT_decl_column : 23
    <755>   DW_AT_type        : <0x93>
    <759>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><75c>: Abbrev Number: 29 (DW_TAG_variable)
    <75d>   DW_AT_name        : (indirect string, offset: 0x1e117): aTxBuffer
    <761>   DW_AT_decl_file   : 1
    <762>   DW_AT_decl_line   : 26
    <763>   DW_AT_decl_column : 11
    <764>   DW_AT_type        : <0x76c>
    <768>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><76b>: Abbrev Number: 0
 <1><76c>: Abbrev Number: 30 (DW_TAG_array_type)
    <76d>   DW_AT_type        : <0x93>
    <771>   DW_AT_sibling     : <0x77c>
 <2><775>: Abbrev Number: 31 (DW_TAG_subrange_type)
    <776>   DW_AT_type        : <0x8c>
    <77a>   DW_AT_upper_bound : 1
 <2><77b>: Abbrev Number: 0
 <1><77c>: Abbrev Number: 32 (DW_TAG_subprogram)
    <77d>   DW_AT_external    : 1
    <77d>   DW_AT_name        : (indirect string, offset: 0x7c62f): lcd_cmd
    <781>   DW_AT_decl_file   : 1
    <782>   DW_AT_decl_line   : 13
    <783>   DW_AT_decl_column : 6
    <784>   DW_AT_prototyped  : 1
    <784>   DW_AT_low_pc      : 0x8000f4c
    <788>   DW_AT_high_pc     : 0x4c
    <78c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <78e>   DW_AT_GNU_all_tail_call_sites: 1
 <2><78e>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <78f>   DW_AT_name        : x
    <791>   DW_AT_decl_file   : 1
    <792>   DW_AT_decl_line   : 13
    <793>   DW_AT_decl_column : 22
    <794>   DW_AT_type        : <0x93>
    <798>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><79b>: Abbrev Number: 29 (DW_TAG_variable)
    <79c>   DW_AT_name        : (indirect string, offset: 0x1e117): aTxBuffer
    <7a0>   DW_AT_decl_file   : 1
    <7a1>   DW_AT_decl_line   : 15
    <7a2>   DW_AT_decl_column : 11
    <7a3>   DW_AT_type        : <0x76c>
    <7a7>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><7aa>: Abbrev Number: 0
 <1><7ab>: Abbrev Number: 0
  Compilation Unit @ offset 0x7ac:
   Length:        0xa1d (32-bit)
   Version:       4
   Abbrev Offset: 0x1f0
   Pointer Size:  4
 <0><7b7>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <7b8>   DW_AT_producer    : (indirect string, offset: 0xcbb65): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <7bc>   DW_AT_language    : 12	(ANSI C99)
    <7bd>   DW_AT_name        : (indirect string, offset: 0xd25b8): ../Core/Src/PL_sensor.c
    <7c1>   DW_AT_comp_dir    : (indirect string, offset: 0x1ec55): C:/Users/sf199/Documents/Mice/Mice_workspace_IDE/normal_mice_3/Debug
    <7c5>   DW_AT_ranges      : 0x40
    <7c9>   DW_AT_low_pc      : 0x0
    <7cd>   DW_AT_stmt_list   : 0x810
    <7d1>   DW_AT_GNU_macros  : 0x1fea7
 <1><7d5>: Abbrev Number: 2 (DW_TAG_base_type)
    <7d6>   DW_AT_byte_size   : 1
    <7d7>   DW_AT_encoding    : 6	(signed char)
    <7d8>   DW_AT_name        : (indirect string, offset: 0x69054): signed char
 <1><7dc>: Abbrev Number: 2 (DW_TAG_base_type)
    <7dd>   DW_AT_byte_size   : 1
    <7de>   DW_AT_encoding    : 8	(unsigned char)
    <7df>   DW_AT_name        : (indirect string, offset: 0xca64f): unsigned char
 <1><7e3>: Abbrev Number: 2 (DW_TAG_base_type)
    <7e4>   DW_AT_byte_size   : 2
    <7e5>   DW_AT_encoding    : 5	(signed)
    <7e6>   DW_AT_name        : (indirect string, offset: 0x9bc0e): short int
 <1><7ea>: Abbrev Number: 3 (DW_TAG_typedef)
    <7eb>   DW_AT_name        : (indirect string, offset: 0xab228): __uint16_t
    <7ef>   DW_AT_decl_file   : 2
    <7f0>   DW_AT_decl_line   : 57
    <7f1>   DW_AT_decl_column : 25
    <7f2>   DW_AT_type        : <0x7f6>
 <1><7f6>: Abbrev Number: 2 (DW_TAG_base_type)
    <7f7>   DW_AT_byte_size   : 2
    <7f8>   DW_AT_encoding    : 7	(unsigned)
    <7f9>   DW_AT_name        : (indirect string, offset: 0xc8de3): short unsigned int
 <1><7fd>: Abbrev Number: 2 (DW_TAG_base_type)
    <7fe>   DW_AT_byte_size   : 4
    <7ff>   DW_AT_encoding    : 5	(signed)
    <800>   DW_AT_name        : (indirect string, offset: 0x127b7): long int
 <1><804>: Abbrev Number: 3 (DW_TAG_typedef)
    <805>   DW_AT_name        : (indirect string, offset: 0x85dd8): __uint32_t
    <809>   DW_AT_decl_file   : 2
    <80a>   DW_AT_decl_line   : 79
    <80b>   DW_AT_decl_column : 25
    <80c>   DW_AT_type        : <0x810>
 <1><810>: Abbrev Number: 2 (DW_TAG_base_type)
    <811>   DW_AT_byte_size   : 4
    <812>   DW_AT_encoding    : 7	(unsigned)
    <813>   DW_AT_name        : (indirect string, offset: 0x4fdbb): long unsigned int
 <1><817>: Abbrev Number: 2 (DW_TAG_base_type)
    <818>   DW_AT_byte_size   : 8
    <819>   DW_AT_encoding    : 5	(signed)
    <81a>   DW_AT_name        : (indirect string, offset: 0x5f807): long long int
 <1><81e>: Abbrev Number: 2 (DW_TAG_base_type)
    <81f>   DW_AT_byte_size   : 8
    <820>   DW_AT_encoding    : 7	(unsigned)
    <821>   DW_AT_name        : (indirect string, offset: 0x2b983): long long unsigned int
 <1><825>: Abbrev Number: 4 (DW_TAG_base_type)
    <826>   DW_AT_byte_size   : 4
    <827>   DW_AT_encoding    : 5	(signed)
    <828>   DW_AT_name        : int
 <1><82c>: Abbrev Number: 2 (DW_TAG_base_type)
    <82d>   DW_AT_byte_size   : 4
    <82e>   DW_AT_encoding    : 7	(unsigned)
    <82f>   DW_AT_name        : (indirect string, offset: 0x11ed1): unsigned int
 <1><833>: Abbrev Number: 3 (DW_TAG_typedef)
    <834>   DW_AT_name        : (indirect string, offset: 0xab22a): uint16_t
    <838>   DW_AT_decl_file   : 3
    <839>   DW_AT_decl_line   : 36
    <83a>   DW_AT_decl_column : 20
    <83b>   DW_AT_type        : <0x7ea>
 <1><83f>: Abbrev Number: 3 (DW_TAG_typedef)
    <840>   DW_AT_name        : (indirect string, offset: 0x85dda): uint32_t
    <844>   DW_AT_decl_file   : 3
    <845>   DW_AT_decl_line   : 48
    <846>   DW_AT_decl_column : 20
    <847>   DW_AT_type        : <0x804>
 <1><84b>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <84c>   DW_AT_type        : <0x83f>
 <1><850>: Abbrev Number: 6 (DW_TAG_structure_type)
    <851>   DW_AT_byte_size   : 184
    <852>   DW_AT_decl_file   : 4
    <853>   DW_AT_decl_line   : 157
    <854>   DW_AT_decl_column : 9
    <855>   DW_AT_sibling     : <0xa39>
 <2><859>: Abbrev Number: 7 (DW_TAG_member)
    <85a>   DW_AT_name        : ISR
    <85e>   DW_AT_decl_file   : 4
    <85f>   DW_AT_decl_line   : 159
    <860>   DW_AT_decl_column : 17
    <861>   DW_AT_type        : <0x84b>
    <865>   DW_AT_data_member_location: 0
 <2><866>: Abbrev Number: 7 (DW_TAG_member)
    <867>   DW_AT_name        : IER
    <86b>   DW_AT_decl_file   : 4
    <86c>   DW_AT_decl_line   : 160
    <86d>   DW_AT_decl_column : 17
    <86e>   DW_AT_type        : <0x84b>
    <872>   DW_AT_data_member_location: 4
 <2><873>: Abbrev Number: 7 (DW_TAG_member)
    <874>   DW_AT_name        : CR
    <877>   DW_AT_decl_file   : 4
    <878>   DW_AT_decl_line   : 161
    <879>   DW_AT_decl_column : 17
    <87a>   DW_AT_type        : <0x84b>
    <87e>   DW_AT_data_member_location: 8
 <2><87f>: Abbrev Number: 8 (DW_TAG_member)
    <880>   DW_AT_name        : (indirect string, offset: 0xd2db5): CFGR
    <884>   DW_AT_decl_file   : 4
    <885>   DW_AT_decl_line   : 162
    <886>   DW_AT_decl_column : 17
    <887>   DW_AT_type        : <0x84b>
    <88b>   DW_AT_data_member_location: 12
 <2><88c>: Abbrev Number: 8 (DW_TAG_member)
    <88d>   DW_AT_name        : (indirect string, offset: 0xd269a): CFGR2
    <891>   DW_AT_decl_file   : 4
    <892>   DW_AT_decl_line   : 163
    <893>   DW_AT_decl_column : 17
    <894>   DW_AT_type        : <0x84b>
    <898>   DW_AT_data_member_location: 16
 <2><899>: Abbrev Number: 8 (DW_TAG_member)
    <89a>   DW_AT_name        : (indirect string, offset: 0xa8978): SMPR1
    <89e>   DW_AT_decl_file   : 4
    <89f>   DW_AT_decl_line   : 164
    <8a0>   DW_AT_decl_column : 17
    <8a1>   DW_AT_type        : <0x84b>
    <8a5>   DW_AT_data_member_location: 20
 <2><8a6>: Abbrev Number: 8 (DW_TAG_member)
    <8a7>   DW_AT_name        : (indirect string, offset: 0x4a8ec): SMPR2
    <8ab>   DW_AT_decl_file   : 4
    <8ac>   DW_AT_decl_line   : 165
    <8ad>   DW_AT_decl_column : 17
    <8ae>   DW_AT_type        : <0x84b>
    <8b2>   DW_AT_data_member_location: 24
 <2><8b3>: Abbrev Number: 8 (DW_TAG_member)
    <8b4>   DW_AT_name        : (indirect string, offset: 0xd28bb): RESERVED1
    <8b8>   DW_AT_decl_file   : 4
    <8b9>   DW_AT_decl_line   : 166
    <8ba>   DW_AT_decl_column : 17
    <8bb>   DW_AT_type        : <0x83f>
    <8bf>   DW_AT_data_member_location: 28
 <2><8c0>: Abbrev Number: 7 (DW_TAG_member)
    <8c1>   DW_AT_name        : TR1
    <8c5>   DW_AT_decl_file   : 4
    <8c6>   DW_AT_decl_line   : 167
    <8c7>   DW_AT_decl_column : 17
    <8c8>   DW_AT_type        : <0x84b>
    <8cc>   DW_AT_data_member_location: 32
 <2><8cd>: Abbrev Number: 7 (DW_TAG_member)
    <8ce>   DW_AT_name        : TR2
    <8d2>   DW_AT_decl_file   : 4
    <8d3>   DW_AT_decl_line   : 168
    <8d4>   DW_AT_decl_column : 17
    <8d5>   DW_AT_type        : <0x84b>
    <8d9>   DW_AT_data_member_location: 36
 <2><8da>: Abbrev Number: 7 (DW_TAG_member)
    <8db>   DW_AT_name        : TR3
    <8df>   DW_AT_decl_file   : 4
    <8e0>   DW_AT_decl_line   : 169
    <8e1>   DW_AT_decl_column : 17
    <8e2>   DW_AT_type        : <0x84b>
    <8e6>   DW_AT_data_member_location: 40
 <2><8e7>: Abbrev Number: 8 (DW_TAG_member)
    <8e8>   DW_AT_name        : (indirect string, offset: 0xd28c5): RESERVED2
    <8ec>   DW_AT_decl_file   : 4
    <8ed>   DW_AT_decl_line   : 170
    <8ee>   DW_AT_decl_column : 17
    <8ef>   DW_AT_type        : <0x83f>
    <8f3>   DW_AT_data_member_location: 44
 <2><8f4>: Abbrev Number: 8 (DW_TAG_member)
    <8f5>   DW_AT_name        : (indirect string, offset: 0x9200d): SQR1
    <8f9>   DW_AT_decl_file   : 4
    <8fa>   DW_AT_decl_line   : 171
    <8fb>   DW_AT_decl_column : 17
    <8fc>   DW_AT_type        : <0x84b>
    <900>   DW_AT_data_member_location: 48
 <2><901>: Abbrev Number: 8 (DW_TAG_member)
    <902>   DW_AT_name        : (indirect string, offset: 0xd2521): SQR2
    <906>   DW_AT_decl_file   : 4
    <907>   DW_AT_decl_line   : 172
    <908>   DW_AT_decl_column : 17
    <909>   DW_AT_type        : <0x84b>
    <90d>   DW_AT_data_member_location: 52
 <2><90e>: Abbrev Number: 8 (DW_TAG_member)
    <90f>   DW_AT_name        : (indirect string, offset: 0xd2526): SQR3
    <913>   DW_AT_decl_file   : 4
    <914>   DW_AT_decl_line   : 173
    <915>   DW_AT_decl_column : 17
    <916>   DW_AT_type        : <0x84b>
    <91a>   DW_AT_data_member_location: 56
 <2><91b>: Abbrev Number: 8 (DW_TAG_member)
    <91c>   DW_AT_name        : (indirect string, offset: 0xd252b): SQR4
    <920>   DW_AT_decl_file   : 4
    <921>   DW_AT_decl_line   : 174
    <922>   DW_AT_decl_column : 17
    <923>   DW_AT_type        : <0x84b>
    <927>   DW_AT_data_member_location: 60
 <2><928>: Abbrev Number: 7 (DW_TAG_member)
    <929>   DW_AT_name        : DR
    <92c>   DW_AT_decl_file   : 4
    <92d>   DW_AT_decl_line   : 175
    <92e>   DW_AT_decl_column : 17
    <92f>   DW_AT_type        : <0x84b>
    <933>   DW_AT_data_member_location: 64
 <2><934>: Abbrev Number: 8 (DW_TAG_member)
    <935>   DW_AT_name        : (indirect string, offset: 0xd28cf): RESERVED3
    <939>   DW_AT_decl_file   : 4
    <93a>   DW_AT_decl_line   : 176
    <93b>   DW_AT_decl_column : 17
    <93c>   DW_AT_type        : <0x83f>
    <940>   DW_AT_data_member_location: 68
 <2><941>: Abbrev Number: 8 (DW_TAG_member)
    <942>   DW_AT_name        : (indirect string, offset: 0xd278f): RESERVED4
    <946>   DW_AT_decl_file   : 4
    <947>   DW_AT_decl_line   : 177
    <948>   DW_AT_decl_column : 17
    <949>   DW_AT_type        : <0x83f>
    <94d>   DW_AT_data_member_location: 72
 <2><94e>: Abbrev Number: 8 (DW_TAG_member)
    <94f>   DW_AT_name        : (indirect string, offset: 0xa0c36): JSQR
    <953>   DW_AT_decl_file   : 4
    <954>   DW_AT_decl_line   : 178
    <955>   DW_AT_decl_column : 17
    <956>   DW_AT_type        : <0x84b>
    <95a>   DW_AT_data_member_location: 76
 <2><95b>: Abbrev Number: 8 (DW_TAG_member)
    <95c>   DW_AT_name        : (indirect string, offset: 0xd28d9): RESERVED5
    <960>   DW_AT_decl_file   : 4
    <961>   DW_AT_decl_line   : 179
    <962>   DW_AT_decl_column : 17
    <963>   DW_AT_type        : <0xa39>
    <967>   DW_AT_data_member_location: 80
 <2><968>: Abbrev Number: 8 (DW_TAG_member)
    <969>   DW_AT_name        : (indirect string, offset: 0xd27e7): OFR1
    <96d>   DW_AT_decl_file   : 4
    <96e>   DW_AT_decl_line   : 180
    <96f>   DW_AT_decl_column : 17
    <970>   DW_AT_type        : <0x84b>
    <974>   DW_AT_data_member_location: 96
 <2><975>: Abbrev Number: 8 (DW_TAG_member)
    <976>   DW_AT_name        : (indirect string, offset: 0xd2863): OFR2
    <97a>   DW_AT_decl_file   : 4
    <97b>   DW_AT_decl_line   : 181
    <97c>   DW_AT_decl_column : 17
    <97d>   DW_AT_type        : <0x84b>
    <981>   DW_AT_data_member_location: 100
 <2><982>: Abbrev Number: 8 (DW_TAG_member)
    <983>   DW_AT_name        : (indirect string, offset: 0xd2868): OFR3
    <987>   DW_AT_decl_file   : 4
    <988>   DW_AT_decl_line   : 182
    <989>   DW_AT_decl_column : 17
    <98a>   DW_AT_type        : <0x84b>
    <98e>   DW_AT_data_member_location: 104
 <2><98f>: Abbrev Number: 8 (DW_TAG_member)
    <990>   DW_AT_name        : (indirect string, offset: 0xd286d): OFR4
    <994>   DW_AT_decl_file   : 4
    <995>   DW_AT_decl_line   : 183
    <996>   DW_AT_decl_column : 17
    <997>   DW_AT_type        : <0x84b>
    <99b>   DW_AT_data_member_location: 108
 <2><99c>: Abbrev Number: 8 (DW_TAG_member)
    <99d>   DW_AT_name        : (indirect string, offset: 0xd2799): RESERVED6
    <9a1>   DW_AT_decl_file   : 4
    <9a2>   DW_AT_decl_line   : 184
    <9a3>   DW_AT_decl_column : 17
    <9a4>   DW_AT_type        : <0xa39>
    <9a8>   DW_AT_data_member_location: 112
 <2><9a9>: Abbrev Number: 8 (DW_TAG_member)
    <9aa>   DW_AT_name        : (indirect string, offset: 0xd27d2): JDR1
    <9ae>   DW_AT_decl_file   : 4
    <9af>   DW_AT_decl_line   : 185
    <9b0>   DW_AT_decl_column : 17
    <9b1>   DW_AT_type        : <0x84b>
    <9b5>   DW_AT_data_member_location: 128
 <2><9b6>: Abbrev Number: 8 (DW_TAG_member)
    <9b7>   DW_AT_name        : (indirect string, offset: 0xd27d7): JDR2
    <9bb>   DW_AT_decl_file   : 4
    <9bc>   DW_AT_decl_line   : 186
    <9bd>   DW_AT_decl_column : 17
    <9be>   DW_AT_type        : <0x84b>
    <9c2>   DW_AT_data_member_location: 132
 <2><9c3>: Abbrev Number: 8 (DW_TAG_member)
    <9c4>   DW_AT_name        : (indirect string, offset: 0xd27dc): JDR3
    <9c8>   DW_AT_decl_file   : 4
    <9c9>   DW_AT_decl_line   : 187
    <9ca>   DW_AT_decl_column : 17
    <9cb>   DW_AT_type        : <0x84b>
    <9cf>   DW_AT_data_member_location: 136
 <2><9d0>: Abbrev Number: 8 (DW_TAG_member)
    <9d1>   DW_AT_name        : (indirect string, offset: 0xd2612): JDR4
    <9d5>   DW_AT_decl_file   : 4
    <9d6>   DW_AT_decl_line   : 188
    <9d7>   DW_AT_decl_column : 17
    <9d8>   DW_AT_type        : <0x84b>
    <9dc>   DW_AT_data_member_location: 140
 <2><9dd>: Abbrev Number: 8 (DW_TAG_member)
    <9de>   DW_AT_name        : (indirect string, offset: 0xd28e3): RESERVED7
    <9e2>   DW_AT_decl_file   : 4
    <9e3>   DW_AT_decl_line   : 189
    <9e4>   DW_AT_decl_column : 17
    <9e5>   DW_AT_type        : <0xa39>
    <9e9>   DW_AT_data_member_location: 144
 <2><9ea>: Abbrev Number: 8 (DW_TAG_member)
    <9eb>   DW_AT_name        : (indirect string, offset: 0xd27cb): AWD2CR
    <9ef>   DW_AT_decl_file   : 4
    <9f0>   DW_AT_decl_line   : 190
    <9f1>   DW_AT_decl_column : 17
    <9f2>   DW_AT_type        : <0x84b>
    <9f6>   DW_AT_data_member_location: 160
 <2><9f7>: Abbrev Number: 8 (DW_TAG_member)
    <9f8>   DW_AT_name        : (indirect string, offset: 0xd283d): AWD3CR
    <9fc>   DW_AT_decl_file   : 4
    <9fd>   DW_AT_decl_line   : 191
    <9fe>   DW_AT_decl_column : 17
    <9ff>   DW_AT_type        : <0x84b>
    <a03>   DW_AT_data_member_location: 164
 <2><a04>: Abbrev Number: 8 (DW_TAG_member)
    <a05>   DW_AT_name        : (indirect string, offset: 0xd28ed): RESERVED8
    <a09>   DW_AT_decl_file   : 4
    <a0a>   DW_AT_decl_line   : 192
    <a0b>   DW_AT_decl_column : 17
    <a0c>   DW_AT_type        : <0x83f>
    <a10>   DW_AT_data_member_location: 168
 <2><a11>: Abbrev Number: 8 (DW_TAG_member)
    <a12>   DW_AT_name        : (indirect string, offset: 0xd28f7): RESERVED9
    <a16>   DW_AT_decl_file   : 4
    <a17>   DW_AT_decl_line   : 193
    <a18>   DW_AT_decl_column : 17
    <a19>   DW_AT_type        : <0x83f>
    <a1d>   DW_AT_data_member_location: 172
 <2><a1e>: Abbrev Number: 8 (DW_TAG_member)
    <a1f>   DW_AT_name        : (indirect string, offset: 0xd263a): DIFSEL
    <a23>   DW_AT_decl_file   : 4
    <a24>   DW_AT_decl_line   : 194
    <a25>   DW_AT_decl_column : 17
    <a26>   DW_AT_type        : <0x84b>
    <a2a>   DW_AT_data_member_location: 176
 <2><a2b>: Abbrev Number: 8 (DW_TAG_member)
    <a2c>   DW_AT_name        : (indirect string, offset: 0xd2632): CALFACT
    <a30>   DW_AT_decl_file   : 4
    <a31>   DW_AT_decl_line   : 195
    <a32>   DW_AT_decl_column : 17
    <a33>   DW_AT_type        : <0x84b>
    <a37>   DW_AT_data_member_location: 180
 <2><a38>: Abbrev Number: 0
 <1><a39>: Abbrev Number: 9 (DW_TAG_array_type)
    <a3a>   DW_AT_type        : <0x83f>
    <a3e>   DW_AT_sibling     : <0xa49>
 <2><a42>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <a43>   DW_AT_type        : <0x82c>
    <a47>   DW_AT_upper_bound : 3
 <2><a48>: Abbrev Number: 0
 <1><a49>: Abbrev Number: 3 (DW_TAG_typedef)
    <a4a>   DW_AT_name        : (indirect string, offset: 0xd2831): ADC_TypeDef
    <a4e>   DW_AT_decl_file   : 4
    <a4f>   DW_AT_decl_line   : 197
    <a50>   DW_AT_decl_column : 3
    <a51>   DW_AT_type        : <0x850>
 <1><a55>: Abbrev Number: 11 (DW_TAG_structure_type)
    <a56>   DW_AT_byte_size   : 16
    <a57>   DW_AT_decl_file   : 4
    <a58>   DW_AT_decl_line   : 361
    <a5a>   DW_AT_decl_column : 9
    <a5b>   DW_AT_sibling     : <0xa98>
 <2><a5f>: Abbrev Number: 12 (DW_TAG_member)
    <a60>   DW_AT_name        : CCR
    <a64>   DW_AT_decl_file   : 4
    <a65>   DW_AT_decl_line   : 363
    <a67>   DW_AT_decl_column : 17
    <a68>   DW_AT_type        : <0x84b>
    <a6c>   DW_AT_data_member_location: 0
 <2><a6d>: Abbrev Number: 13 (DW_TAG_member)
    <a6e>   DW_AT_name        : (indirect string, offset: 0x89429): CNDTR
    <a72>   DW_AT_decl_file   : 4
    <a73>   DW_AT_decl_line   : 364
    <a75>   DW_AT_decl_column : 17
    <a76>   DW_AT_type        : <0x84b>
    <a7a>   DW_AT_data_member_location: 4
 <2><a7b>: Abbrev Number: 13 (DW_TAG_member)
    <a7c>   DW_AT_name        : (indirect string, offset: 0xca81b): CPAR
    <a80>   DW_AT_decl_file   : 4
    <a81>   DW_AT_decl_line   : 365
    <a83>   DW_AT_decl_column : 17
    <a84>   DW_AT_type        : <0x84b>
    <a88>   DW_AT_data_member_location: 8
 <2><a89>: Abbrev Number: 13 (DW_TAG_member)
    <a8a>   DW_AT_name        : (indirect string, offset: 0x7425d): CMAR
    <a8e>   DW_AT_decl_file   : 4
    <a8f>   DW_AT_decl_line   : 366
    <a91>   DW_AT_decl_column : 17
    <a92>   DW_AT_type        : <0x84b>
    <a96>   DW_AT_data_member_location: 12
 <2><a97>: Abbrev Number: 0
 <1><a98>: Abbrev Number: 14 (DW_TAG_typedef)
    <a99>   DW_AT_name        : (indirect string, offset: 0xc5a2f): DMA_Channel_TypeDef
    <a9d>   DW_AT_decl_file   : 4
    <a9e>   DW_AT_decl_line   : 367
    <aa0>   DW_AT_decl_column : 3
    <aa1>   DW_AT_type        : <0xa55>
 <1><aa5>: Abbrev Number: 11 (DW_TAG_structure_type)
    <aa6>   DW_AT_byte_size   : 8
    <aa7>   DW_AT_decl_file   : 4
    <aa8>   DW_AT_decl_line   : 369
    <aaa>   DW_AT_decl_column : 9
    <aab>   DW_AT_sibling     : <0xacc>
 <2><aaf>: Abbrev Number: 12 (DW_TAG_member)
    <ab0>   DW_AT_name        : ISR
    <ab4>   DW_AT_decl_file   : 4
    <ab5>   DW_AT_decl_line   : 371
    <ab7>   DW_AT_decl_column : 17
    <ab8>   DW_AT_type        : <0x84b>
    <abc>   DW_AT_data_member_location: 0
 <2><abd>: Abbrev Number: 13 (DW_TAG_member)
    <abe>   DW_AT_name        : (indirect string, offset: 0x92ca5): IFCR
    <ac2>   DW_AT_decl_file   : 4
    <ac3>   DW_AT_decl_line   : 372
    <ac5>   DW_AT_decl_column : 17
    <ac6>   DW_AT_type        : <0x84b>
    <aca>   DW_AT_data_member_location: 4
 <2><acb>: Abbrev Number: 0
 <1><acc>: Abbrev Number: 14 (DW_TAG_typedef)
    <acd>   DW_AT_name        : (indirect string, offset: 0x4bf06): DMA_TypeDef
    <ad1>   DW_AT_decl_file   : 4
    <ad2>   DW_AT_decl_line   : 373
    <ad4>   DW_AT_decl_column : 3
    <ad5>   DW_AT_type        : <0xaa5>
 <1><ad9>: Abbrev Number: 11 (DW_TAG_structure_type)
    <ada>   DW_AT_byte_size   : 44
    <adb>   DW_AT_decl_file   : 4
    <adc>   DW_AT_decl_line   : 452
    <ade>   DW_AT_decl_column : 9
    <adf>   DW_AT_sibling     : <0xb70>
 <2><ae3>: Abbrev Number: 13 (DW_TAG_member)
    <ae4>   DW_AT_name        : (indirect string, offset: 0xd24fa): MODER
    <ae8>   DW_AT_decl_file   : 4
    <ae9>   DW_AT_decl_line   : 454
    <aeb>   DW_AT_decl_column : 17
    <aec>   DW_AT_type        : <0x84b>
    <af0>   DW_AT_data_member_location: 0
 <2><af1>: Abbrev Number: 13 (DW_TAG_member)
    <af2>   DW_AT_name        : (indirect string, offset: 0xd2844): OTYPER
    <af6>   DW_AT_decl_file   : 4
    <af7>   DW_AT_decl_line   : 455
    <af9>   DW_AT_decl_column : 17
    <afa>   DW_AT_type        : <0x84b>
    <afe>   DW_AT_data_member_location: 4
 <2><aff>: Abbrev Number: 13 (DW_TAG_member)
    <b00>   DW_AT_name        : (indirect string, offset: 0xd2898): OSPEEDR
    <b04>   DW_AT_decl_file   : 4
    <b05>   DW_AT_decl_line   : 456
    <b07>   DW_AT_decl_column : 17
    <b08>   DW_AT_type        : <0x84b>
    <b0c>   DW_AT_data_member_location: 8
 <2><b0d>: Abbrev Number: 13 (DW_TAG_member)
    <b0e>   DW_AT_name        : (indirect string, offset: 0xd27e1): PUPDR
    <b12>   DW_AT_decl_file   : 4
    <b13>   DW_AT_decl_line   : 457
    <b15>   DW_AT_decl_column : 17
    <b16>   DW_AT_type        : <0x84b>
    <b1a>   DW_AT_data_member_location: 12
 <2><b1b>: Abbrev Number: 12 (DW_TAG_member)
    <b1c>   DW_AT_name        : IDR
    <b20>   DW_AT_decl_file   : 4
    <b21>   DW_AT_decl_line   : 458
    <b23>   DW_AT_decl_column : 17
    <b24>   DW_AT_type        : <0x84b>
    <b28>   DW_AT_data_member_location: 16
 <2><b29>: Abbrev Number: 12 (DW_TAG_member)
    <b2a>   DW_AT_name        : ODR
    <b2e>   DW_AT_decl_file   : 4
    <b2f>   DW_AT_decl_line   : 459
    <b31>   DW_AT_decl_column : 17
    <b32>   DW_AT_type        : <0x84b>
    <b36>   DW_AT_data_member_location: 20
 <2><b37>: Abbrev Number: 13 (DW_TAG_member)
    <b38>   DW_AT_name        : (indirect string, offset: 0xd25e9): BSRR
    <b3c>   DW_AT_decl_file   : 4
    <b3d>   DW_AT_decl_line   : 460
    <b3f>   DW_AT_decl_column : 17
    <b40>   DW_AT_type        : <0x84b>
    <b44>   DW_AT_data_member_location: 24
 <2><b45>: Abbrev Number: 13 (DW_TAG_member)
    <b46>   DW_AT_name        : (indirect string, offset: 0xd2882): LCKR
    <b4a>   DW_AT_decl_file   : 4
    <b4b>   DW_AT_decl_line   : 461
    <b4d>   DW_AT_decl_column : 17
    <b4e>   DW_AT_type        : <0x84b>
    <b52>   DW_AT_data_member_location: 28
 <2><b53>: Abbrev Number: 12 (DW_TAG_member)
    <b54>   DW_AT_name        : AFR
    <b58>   DW_AT_decl_file   : 4
    <b59>   DW_AT_decl_line   : 462
    <b5b>   DW_AT_decl_column : 17
    <b5c>   DW_AT_type        : <0xb80>
    <b60>   DW_AT_data_member_location: 32
 <2><b61>: Abbrev Number: 12 (DW_TAG_member)
    <b62>   DW_AT_name        : BRR
    <b66>   DW_AT_decl_file   : 4
    <b67>   DW_AT_decl_line   : 463
    <b69>   DW_AT_decl_column : 17
    <b6a>   DW_AT_type        : <0x84b>
    <b6e>   DW_AT_data_member_location: 40
 <2><b6f>: Abbrev Number: 0
 <1><b70>: Abbrev Number: 9 (DW_TAG_array_type)
    <b71>   DW_AT_type        : <0x84b>
    <b75>   DW_AT_sibling     : <0xb80>
 <2><b79>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <b7a>   DW_AT_type        : <0x82c>
    <b7e>   DW_AT_upper_bound : 1
 <2><b7f>: Abbrev Number: 0
 <1><b80>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <b81>   DW_AT_type        : <0xb70>
 <1><b85>: Abbrev Number: 14 (DW_TAG_typedef)
    <b86>   DW_AT_name        : (indirect string, offset: 0xd2901): GPIO_TypeDef
    <b8a>   DW_AT_decl_file   : 4
    <b8b>   DW_AT_decl_line   : 465
    <b8d>   DW_AT_decl_column : 3
    <b8e>   DW_AT_type        : <0xad9>
 <1><b92>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <b93>   DW_AT_encoding    : 7	(unsigned)
    <b94>   DW_AT_byte_size   : 1
    <b95>   DW_AT_type        : <0x7dc>
    <b99>   DW_AT_decl_file   : 5
    <b9a>   DW_AT_decl_line   : 193
    <b9b>   DW_AT_decl_column : 1
    <b9c>   DW_AT_sibling     : <0xbad>
 <2><ba0>: Abbrev Number: 16 (DW_TAG_enumerator)
    <ba1>   DW_AT_name        : (indirect string, offset: 0x27801): DISABLE
    <ba5>   DW_AT_const_value : 0
 <2><ba6>: Abbrev Number: 16 (DW_TAG_enumerator)
    <ba7>   DW_AT_name        : (indirect string, offset: 0x2e091): ENABLE
    <bab>   DW_AT_const_value : 1
 <2><bac>: Abbrev Number: 0
 <1><bad>: Abbrev Number: 3 (DW_TAG_typedef)
    <bae>   DW_AT_name        : (indirect string, offset: 0xd2872): FunctionalState
    <bb2>   DW_AT_decl_file   : 5
    <bb3>   DW_AT_decl_line   : 196
    <bb4>   DW_AT_decl_column : 3
    <bb5>   DW_AT_type        : <0xb92>
 <1><bb9>: Abbrev Number: 2 (DW_TAG_base_type)
    <bba>   DW_AT_byte_size   : 8
    <bbb>   DW_AT_encoding    : 4	(float)
    <bbc>   DW_AT_name        : (indirect string, offset: 0xd402a): long double
 <1><bc0>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <bc1>   DW_AT_encoding    : 7	(unsigned)
    <bc2>   DW_AT_byte_size   : 1
    <bc3>   DW_AT_type        : <0x7dc>
    <bc7>   DW_AT_decl_file   : 6
    <bc8>   DW_AT_decl_line   : 40
    <bc9>   DW_AT_decl_column : 1
    <bca>   DW_AT_sibling     : <0xbe7>
 <2><bce>: Abbrev Number: 16 (DW_TAG_enumerator)
    <bcf>   DW_AT_name        : (indirect string, offset: 0x4631d): HAL_OK
    <bd3>   DW_AT_const_value : 0
 <2><bd4>: Abbrev Number: 16 (DW_TAG_enumerator)
    <bd5>   DW_AT_name        : (indirect string, offset: 0x83618): HAL_ERROR
    <bd9>   DW_AT_const_value : 1
 <2><bda>: Abbrev Number: 16 (DW_TAG_enumerator)
    <bdb>   DW_AT_name        : (indirect string, offset: 0x25084): HAL_BUSY
    <bdf>   DW_AT_const_value : 2
 <2><be0>: Abbrev Number: 16 (DW_TAG_enumerator)
    <be1>   DW_AT_name        : (indirect string, offset: 0x3d1bb): HAL_TIMEOUT
    <be5>   DW_AT_const_value : 3
 <2><be6>: Abbrev Number: 0
 <1><be7>: Abbrev Number: 3 (DW_TAG_typedef)
    <be8>   DW_AT_name        : (indirect string, offset: 0x2972): HAL_StatusTypeDef
    <bec>   DW_AT_decl_file   : 6
    <bed>   DW_AT_decl_line   : 45
    <bee>   DW_AT_decl_column : 3
    <bef>   DW_AT_type        : <0xbc0>
 <1><bf3>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <bf4>   DW_AT_encoding    : 7	(unsigned)
    <bf5>   DW_AT_byte_size   : 1
    <bf6>   DW_AT_type        : <0x7dc>
    <bfa>   DW_AT_decl_file   : 6
    <bfb>   DW_AT_decl_line   : 51
    <bfc>   DW_AT_decl_column : 1
    <bfd>   DW_AT_sibling     : <0xc0e>
 <2><c01>: Abbrev Number: 16 (DW_TAG_enumerator)
    <c02>   DW_AT_name        : (indirect string, offset: 0x9ac5b): HAL_UNLOCKED
    <c06>   DW_AT_const_value : 0
 <2><c07>: Abbrev Number: 16 (DW_TAG_enumerator)
    <c08>   DW_AT_name        : (indirect string, offset: 0xd1739): HAL_LOCKED
    <c0c>   DW_AT_const_value : 1
 <2><c0d>: Abbrev Number: 0
 <1><c0e>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0f>   DW_AT_name        : (indirect string, offset: 0x7b637): HAL_LockTypeDef
    <c13>   DW_AT_decl_file   : 6
    <c14>   DW_AT_decl_line   : 54
    <c15>   DW_AT_decl_column : 3
    <c16>   DW_AT_type        : <0xbf3>
 <1><c1a>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <c1b>   DW_AT_encoding    : 7	(unsigned)
    <c1c>   DW_AT_byte_size   : 1
    <c1d>   DW_AT_type        : <0x7dc>
    <c21>   DW_AT_decl_file   : 7
    <c22>   DW_AT_decl_line   : 69
    <c23>   DW_AT_decl_column : 1
    <c24>   DW_AT_sibling     : <0xc35>
 <2><c28>: Abbrev Number: 16 (DW_TAG_enumerator)
    <c29>   DW_AT_name        : (indirect string, offset: 0xd25d0): GPIO_PIN_RESET
    <c2d>   DW_AT_const_value : 0
 <2><c2e>: Abbrev Number: 16 (DW_TAG_enumerator)
    <c2f>   DW_AT_name        : (indirect string, offset: 0xd2577): GPIO_PIN_SET
    <c33>   DW_AT_const_value : 1
 <2><c34>: Abbrev Number: 0
 <1><c35>: Abbrev Number: 3 (DW_TAG_typedef)
    <c36>   DW_AT_name        : (indirect string, offset: 0xd290e): GPIO_PinState
    <c3a>   DW_AT_decl_file   : 7
    <c3b>   DW_AT_decl_line   : 72
    <c3c>   DW_AT_decl_column : 2
    <c3d>   DW_AT_type        : <0xc1a>
 <1><c41>: Abbrev Number: 6 (DW_TAG_structure_type)
    <c42>   DW_AT_byte_size   : 32
    <c43>   DW_AT_decl_file   : 8
    <c44>   DW_AT_decl_line   : 47
    <c45>   DW_AT_decl_column : 9
    <c46>   DW_AT_sibling     : <0xcb3>
 <2><c4a>: Abbrev Number: 8 (DW_TAG_member)
    <c4b>   DW_AT_name        : (indirect string, offset: 0xdab2d): Request
    <c4f>   DW_AT_decl_file   : 8
    <c50>   DW_AT_decl_line   : 49
    <c51>   DW_AT_decl_column : 12
    <c52>   DW_AT_type        : <0x83f>
    <c56>   DW_AT_data_member_location: 0
 <2><c57>: Abbrev Number: 8 (DW_TAG_member)
    <c58>   DW_AT_name        : (indirect string, offset: 0xdb07e): Direction
    <c5c>   DW_AT_decl_file   : 8
    <c5d>   DW_AT_decl_line   : 52
    <c5e>   DW_AT_decl_column : 12
    <c5f>   DW_AT_type        : <0x83f>
    <c63>   DW_AT_data_member_location: 4
 <2><c64>: Abbrev Number: 8 (DW_TAG_member)
    <c65>   DW_AT_name        : (indirect string, offset: 0xe80e): PeriphInc
    <c69>   DW_AT_decl_file   : 8
    <c6a>   DW_AT_decl_line   : 56
    <c6b>   DW_AT_decl_column : 12
    <c6c>   DW_AT_type        : <0x83f>
    <c70>   DW_AT_data_member_location: 8
 <2><c71>: Abbrev Number: 8 (DW_TAG_member)
    <c72>   DW_AT_name        : (indirect string, offset: 0x212fd): MemInc
    <c76>   DW_AT_decl_file   : 8
    <c77>   DW_AT_decl_line   : 59
    <c78>   DW_AT_decl_column : 12
    <c79>   DW_AT_type        : <0x83f>
    <c7d>   DW_AT_data_member_location: 12
 <2><c7e>: Abbrev Number: 8 (DW_TAG_member)
    <c7f>   DW_AT_name        : (indirect string, offset: 0x68532): PeriphDataAlignment
    <c83>   DW_AT_decl_file   : 8
    <c84>   DW_AT_decl_line   : 62
    <c85>   DW_AT_decl_column : 12
    <c86>   DW_AT_type        : <0x83f>
    <c8a>   DW_AT_data_member_location: 16
 <2><c8b>: Abbrev Number: 8 (DW_TAG_member)
    <c8c>   DW_AT_name        : (indirect string, offset: 0xbd556): MemDataAlignment
    <c90>   DW_AT_decl_file   : 8
    <c91>   DW_AT_decl_line   : 65
    <c92>   DW_AT_decl_column : 12
    <c93>   DW_AT_type        : <0x83f>
    <c97>   DW_AT_data_member_location: 20
 <2><c98>: Abbrev Number: 8 (DW_TAG_member)
    <c99>   DW_AT_name        : (indirect string, offset: 0xdbace): Mode
    <c9d>   DW_AT_decl_file   : 8
    <c9e>   DW_AT_decl_line   : 68
    <c9f>   DW_AT_decl_column : 12
    <ca0>   DW_AT_type        : <0x83f>
    <ca4>   DW_AT_data_member_location: 24
 <2><ca5>: Abbrev Number: 8 (DW_TAG_member)
    <ca6>   DW_AT_name        : (indirect string, offset: 0xda378): Priority
    <caa>   DW_AT_decl_file   : 8
    <cab>   DW_AT_decl_line   : 73
    <cac>   DW_AT_decl_column : 12
    <cad>   DW_AT_type        : <0x83f>
    <cb1>   DW_AT_data_member_location: 28
 <2><cb2>: Abbrev Number: 0
 <1><cb3>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb4>   DW_AT_name        : (indirect string, offset: 0x38428): DMA_InitTypeDef
    <cb8>   DW_AT_decl_file   : 8
    <cb9>   DW_AT_decl_line   : 75
    <cba>   DW_AT_decl_column : 3
    <cbb>   DW_AT_type        : <0xc41>
 <1><cbf>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <cc0>   DW_AT_encoding    : 7	(unsigned)
    <cc1>   DW_AT_byte_size   : 1
    <cc2>   DW_AT_type        : <0x7dc>
    <cc6>   DW_AT_decl_file   : 8
    <cc7>   DW_AT_decl_line   : 81
    <cc8>   DW_AT_decl_column : 1
    <cc9>   DW_AT_sibling     : <0xce6>
 <2><ccd>: Abbrev Number: 16 (DW_TAG_enumerator)
    <cce>   DW_AT_name        : (indirect string, offset: 0x9bf65): HAL_DMA_STATE_RESET
    <cd2>   DW_AT_const_value : 0
 <2><cd3>: Abbrev Number: 16 (DW_TAG_enumerator)
    <cd4>   DW_AT_name        : (indirect string, offset: 0x396cb): HAL_DMA_STATE_READY
    <cd8>   DW_AT_const_value : 1
 <2><cd9>: Abbrev Number: 16 (DW_TAG_enumerator)
    <cda>   DW_AT_name        : (indirect string, offset: 0x91557): HAL_DMA_STATE_BUSY
    <cde>   DW_AT_const_value : 2
 <2><cdf>: Abbrev Number: 16 (DW_TAG_enumerator)
    <ce0>   DW_AT_name        : (indirect string, offset: 0xce420): HAL_DMA_STATE_TIMEOUT
    <ce4>   DW_AT_const_value : 3
 <2><ce5>: Abbrev Number: 0
 <1><ce6>: Abbrev Number: 3 (DW_TAG_typedef)
    <ce7>   DW_AT_name        : (indirect string, offset: 0x73a1a): HAL_DMA_StateTypeDef
    <ceb>   DW_AT_decl_file   : 8
    <cec>   DW_AT_decl_line   : 86
    <ced>   DW_AT_decl_column : 2
    <cee>   DW_AT_type        : <0xcbf>
 <1><cf2>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <cf3>   DW_AT_type        : <0xce6>
 <1><cf7>: Abbrev Number: 17 (DW_TAG_structure_type)
    <cf8>   DW_AT_name        : (indirect string, offset: 0xb251a): __DMA_HandleTypeDef
    <cfc>   DW_AT_byte_size   : 72
    <cfd>   DW_AT_decl_file   : 8
    <cfe>   DW_AT_decl_line   : 113
    <cff>   DW_AT_decl_column : 16
    <d00>   DW_AT_sibling     : <0xda1>
 <2><d04>: Abbrev Number: 8 (DW_TAG_member)
    <d05>   DW_AT_name        : (indirect string, offset: 0xaaf8c): Instance
    <d09>   DW_AT_decl_file   : 8
    <d0a>   DW_AT_decl_line   : 115
    <d0b>   DW_AT_decl_column : 27
    <d0c>   DW_AT_type        : <0xda1>
    <d10>   DW_AT_data_member_location: 0
 <2><d11>: Abbrev Number: 8 (DW_TAG_member)
    <d12>   DW_AT_name        : (indirect string, offset: 0xdc3cc): Init
    <d16>   DW_AT_decl_file   : 8
    <d17>   DW_AT_decl_line   : 117
    <d18>   DW_AT_decl_column : 25
    <d19>   DW_AT_type        : <0xcb3>
    <d1d>   DW_AT_data_member_location: 4
 <2><d1e>: Abbrev Number: 8 (DW_TAG_member)
    <d1f>   DW_AT_name        : (indirect string, offset: 0x95373): Lock
    <d23>   DW_AT_decl_file   : 8
    <d24>   DW_AT_decl_line   : 119
    <d25>   DW_AT_decl_column : 25
    <d26>   DW_AT_type        : <0xc0e>
    <d2a>   DW_AT_data_member_location: 36
 <2><d2b>: Abbrev Number: 8 (DW_TAG_member)
    <d2c>   DW_AT_name        : (indirect string, offset: 0xd9131): State
    <d30>   DW_AT_decl_file   : 8
    <d31>   DW_AT_decl_line   : 121
    <d32>   DW_AT_decl_column : 30
    <d33>   DW_AT_type        : <0xcf2>
    <d37>   DW_AT_data_member_location: 37
 <2><d38>: Abbrev Number: 8 (DW_TAG_member)
    <d39>   DW_AT_name        : (indirect string, offset: 0xc76bd): Parent
    <d3d>   DW_AT_decl_file   : 8
    <d3e>   DW_AT_decl_line   : 123
    <d3f>   DW_AT_decl_column : 26
    <d40>   DW_AT_type        : <0xda7>
    <d44>   DW_AT_data_member_location: 40
 <2><d45>: Abbrev Number: 8 (DW_TAG_member)
    <d46>   DW_AT_name        : (indirect string, offset: 0xd0a80): XferCpltCallback
    <d4a>   DW_AT_decl_file   : 8
    <d4b>   DW_AT_decl_line   : 125
    <d4c>   DW_AT_decl_column : 28
    <d4d>   DW_AT_type        : <0xdba>
    <d51>   DW_AT_data_member_location: 44
 <2><d52>: Abbrev Number: 8 (DW_TAG_member)
    <d53>   DW_AT_name        : (indirect string, offset: 0xa2cc0): XferHalfCpltCallback
    <d57>   DW_AT_decl_file   : 8
    <d58>   DW_AT_decl_line   : 127
    <d59>   DW_AT_decl_column : 28
    <d5a>   DW_AT_type        : <0xdba>
    <d5e>   DW_AT_data_member_location: 48
 <2><d5f>: Abbrev Number: 8 (DW_TAG_member)
    <d60>   DW_AT_name        : (indirect string, offset: 0x1ea33): XferErrorCallback
    <d64>   DW_AT_decl_file   : 8
    <d65>   DW_AT_decl_line   : 129
    <d66>   DW_AT_decl_column : 28
    <d67>   DW_AT_type        : <0xdba>
    <d6b>   DW_AT_data_member_location: 52
 <2><d6c>: Abbrev Number: 8 (DW_TAG_member)
    <d6d>   DW_AT_name        : (indirect string, offset: 0xc36a6): XferAbortCallback
    <d71>   DW_AT_decl_file   : 8
    <d72>   DW_AT_decl_line   : 131
    <d73>   DW_AT_decl_column : 28
    <d74>   DW_AT_type        : <0xdba>
    <d78>   DW_AT_data_member_location: 56
 <2><d79>: Abbrev Number: 8 (DW_TAG_member)
    <d7a>   DW_AT_name        : (indirect string, offset: 0xcd034): ErrorCode
    <d7e>   DW_AT_decl_file   : 8
    <d7f>   DW_AT_decl_line   : 133
    <d80>   DW_AT_decl_column : 25
    <d81>   DW_AT_type        : <0x84b>
    <d85>   DW_AT_data_member_location: 60
 <2><d86>: Abbrev Number: 8 (DW_TAG_member)
    <d87>   DW_AT_name        : (indirect string, offset: 0x5498a): DmaBaseAddress
    <d8b>   DW_AT_decl_file   : 8
    <d8c>   DW_AT_decl_line   : 135
    <d8d>   DW_AT_decl_column : 26
    <d8e>   DW_AT_type        : <0xdc0>
    <d92>   DW_AT_data_member_location: 64
 <2><d93>: Abbrev Number: 8 (DW_TAG_member)
    <d94>   DW_AT_name        : (indirect string, offset: 0xe785): ChannelIndex
    <d98>   DW_AT_decl_file   : 8
    <d99>   DW_AT_decl_line   : 137
    <d9a>   DW_AT_decl_column : 25
    <d9b>   DW_AT_type        : <0x83f>
    <d9f>   DW_AT_data_member_location: 68
 <2><da0>: Abbrev Number: 0
 <1><da1>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <da2>   DW_AT_byte_size   : 4
    <da3>   DW_AT_type        : <0xa98>
 <1><da7>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <da8>   DW_AT_byte_size   : 4
 <1><da9>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <daa>   DW_AT_prototyped  : 1
    <daa>   DW_AT_sibling     : <0xdb4>
 <2><dae>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <daf>   DW_AT_type        : <0xdb4>
 <2><db3>: Abbrev Number: 0
 <1><db4>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <db5>   DW_AT_byte_size   : 4
    <db6>   DW_AT_type        : <0xcf7>
 <1><dba>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <dbb>   DW_AT_byte_size   : 4
    <dbc>   DW_AT_type        : <0xda9>
 <1><dc0>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <dc1>   DW_AT_byte_size   : 4
    <dc2>   DW_AT_type        : <0xacc>
 <1><dc6>: Abbrev Number: 3 (DW_TAG_typedef)
    <dc7>   DW_AT_name        : (indirect string, offset: 0xb251c): DMA_HandleTypeDef
    <dcb>   DW_AT_decl_file   : 8
    <dcc>   DW_AT_decl_line   : 154
    <dcd>   DW_AT_decl_column : 2
    <dce>   DW_AT_type        : <0xcf7>
 <1><dd2>: Abbrev Number: 6 (DW_TAG_structure_type)
    <dd3>   DW_AT_byte_size   : 16
    <dd4>   DW_AT_decl_file   : 9
    <dd5>   DW_AT_decl_line   : 50
    <dd6>   DW_AT_decl_column : 9
    <dd7>   DW_AT_sibling     : <0xe10>
 <2><ddb>: Abbrev Number: 8 (DW_TAG_member)
    <ddc>   DW_AT_name        : (indirect string, offset: 0xd275c): Ratio
    <de0>   DW_AT_decl_file   : 9
    <de1>   DW_AT_decl_line   : 52
    <de2>   DW_AT_decl_column : 12
    <de3>   DW_AT_type        : <0x83f>
    <de7>   DW_AT_data_member_location: 0
 <2><de8>: Abbrev Number: 8 (DW_TAG_member)
    <de9>   DW_AT_name        : (indirect string, offset: 0xd2703): RightBitShift
    <ded>   DW_AT_decl_file   : 9
    <dee>   DW_AT_decl_line   : 55
    <def>   DW_AT_decl_column : 12
    <df0>   DW_AT_type        : <0x83f>
    <df4>   DW_AT_data_member_location: 4
 <2><df5>: Abbrev Number: 8 (DW_TAG_member)
    <df6>   DW_AT_name        : (indirect string, offset: 0xd2641): TriggeredMode
    <dfa>   DW_AT_decl_file   : 9
    <dfb>   DW_AT_decl_line   : 58
    <dfc>   DW_AT_decl_column : 12
    <dfd>   DW_AT_type        : <0x83f>
    <e01>   DW_AT_data_member_location: 8
 <2><e02>: Abbrev Number: 8 (DW_TAG_member)
    <e03>   DW_AT_name        : (indirect string, offset: 0xd2544): OversamplingStopReset
    <e07>   DW_AT_decl_file   : 9
    <e08>   DW_AT_decl_line   : 61
    <e09>   DW_AT_decl_column : 12
    <e0a>   DW_AT_type        : <0x83f>
    <e0e>   DW_AT_data_member_location: 12
 <2><e0f>: Abbrev Number: 0
 <1><e10>: Abbrev Number: 3 (DW_TAG_typedef)
    <e11>   DW_AT_name        : (indirect string, offset: 0xd2711): ADC_OversamplingTypeDef
    <e15>   DW_AT_decl_file   : 9
    <e16>   DW_AT_decl_line   : 69
    <e17>   DW_AT_decl_column : 3
    <e18>   DW_AT_type        : <0xdd2>
 <1><e1c>: Abbrev Number: 6 (DW_TAG_structure_type)
    <e1d>   DW_AT_byte_size   : 72
    <e1e>   DW_AT_decl_file   : 9
    <e1f>   DW_AT_decl_line   : 87
    <e20>   DW_AT_decl_column : 9
    <e21>   DW_AT_sibling     : <0xef6>
 <2><e25>: Abbrev Number: 8 (DW_TAG_member)
    <e26>   DW_AT_name        : (indirect string, offset: 0xd28a0): ClockPrescaler
    <e2a>   DW_AT_decl_file   : 9
    <e2b>   DW_AT_decl_line   : 89
    <e2c>   DW_AT_decl_column : 12
    <e2d>   DW_AT_type        : <0x83f>
    <e31>   DW_AT_data_member_location: 0
 <2><e32>: Abbrev Number: 8 (DW_TAG_member)
    <e33>   DW_AT_name        : (indirect string, offset: 0xd2530): Resolution
    <e37>   DW_AT_decl_file   : 9
    <e38>   DW_AT_decl_line   : 100
    <e39>   DW_AT_decl_column : 12
    <e3a>   DW_AT_type        : <0x83f>
    <e3e>   DW_AT_data_member_location: 4
 <2><e3f>: Abbrev Number: 8 (DW_TAG_member)
    <e40>   DW_AT_name        : (indirect string, offset: 0xd25df): DataAlign
    <e44>   DW_AT_decl_file   : 9
    <e45>   DW_AT_decl_line   : 103
    <e46>   DW_AT_decl_column : 12
    <e47>   DW_AT_type        : <0x83f>
    <e4b>   DW_AT_data_member_location: 8
 <2><e4c>: Abbrev Number: 8 (DW_TAG_member)
    <e4d>   DW_AT_name        : (indirect string, offset: 0xd27b3): ScanConvMode
    <e51>   DW_AT_decl_file   : 9
    <e52>   DW_AT_decl_line   : 107
    <e53>   DW_AT_decl_column : 12
    <e54>   DW_AT_type        : <0x83f>
    <e58>   DW_AT_data_member_location: 12
 <2><e59>: Abbrev Number: 8 (DW_TAG_member)
    <e5a>   DW_AT_name        : (indirect string, offset: 0x8243): EOCSelection
    <e5e>   DW_AT_decl_file   : 9
    <e5f>   DW_AT_decl_line   : 115
    <e60>   DW_AT_decl_column : 12
    <e61>   DW_AT_type        : <0x83f>
    <e65>   DW_AT_data_member_location: 16
 <2><e66>: Abbrev Number: 8 (DW_TAG_member)
    <e67>   DW_AT_name        : (indirect string, offset: 0xd2887): LowPowerAutoWait
    <e6b>   DW_AT_decl_file   : 9
    <e6c>   DW_AT_decl_line   : 118
    <e6d>   DW_AT_decl_column : 19
    <e6e>   DW_AT_type        : <0xbad>
    <e72>   DW_AT_data_member_location: 20
 <2><e73>: Abbrev Number: 8 (DW_TAG_member)
    <e74>   DW_AT_name        : (indirect string, offset: 0xd2687): ContinuousConvMode
    <e78>   DW_AT_decl_file   : 9
    <e79>   DW_AT_decl_line   : 130
    <e7a>   DW_AT_decl_column : 19
    <e7b>   DW_AT_type        : <0xbad>
    <e7f>   DW_AT_data_member_location: 21
 <2><e80>: Abbrev Number: 8 (DW_TAG_member)
    <e81>   DW_AT_name        : (indirect string, offset: 0xd27a3): NbrOfConversion
    <e85>   DW_AT_decl_file   : 9
    <e86>   DW_AT_decl_line   : 134
    <e87>   DW_AT_decl_column : 12
    <e88>   DW_AT_type        : <0x83f>
    <e8c>   DW_AT_data_member_location: 24
 <2><e8d>: Abbrev Number: 8 (DW_TAG_member)
    <e8e>   DW_AT_name        : (indirect string, offset: 0xd26c6): DiscontinuousConvMode
    <e92>   DW_AT_decl_file   : 9
    <e93>   DW_AT_decl_line   : 140
    <e94>   DW_AT_decl_column : 19
    <e95>   DW_AT_type        : <0xbad>
    <e99>   DW_AT_data_member_location: 28
 <2><e9a>: Abbrev Number: 8 (DW_TAG_member)
    <e9b>   DW_AT_name        : (indirect string, offset: 0xd255a): NbrOfDiscConversion
    <e9f>   DW_AT_decl_file   : 9
    <ea0>   DW_AT_decl_line   : 146
    <ea1>   DW_AT_decl_column : 12
    <ea2>   DW_AT_type        : <0x83f>
    <ea6>   DW_AT_data_member_location: 32
 <2><ea7>: Abbrev Number: 8 (DW_TAG_member)
    <ea8>   DW_AT_name        : (indirect string, offset: 0xd2813): ExternalTrigConv
    <eac>   DW_AT_decl_file   : 9
    <ead>   DW_AT_decl_line   : 150
    <eae>   DW_AT_decl_column : 12
    <eaf>   DW_AT_type        : <0x83f>
    <eb3>   DW_AT_data_member_location: 36
 <2><eb4>: Abbrev Number: 8 (DW_TAG_member)
    <eb5>   DW_AT_name        : (indirect string, offset: 0xd2617): ExternalTrigConvEdge
    <eb9>   DW_AT_decl_file   : 9
    <eba>   DW_AT_decl_line   : 155
    <ebb>   DW_AT_decl_column : 12
    <ebc>   DW_AT_type        : <0x83f>
    <ec0>   DW_AT_data_member_location: 40
 <2><ec1>: Abbrev Number: 8 (DW_TAG_member)
    <ec2>   DW_AT_name        : (indirect string, offset: 0xd2500): DMAContinuousRequests
    <ec6>   DW_AT_decl_file   : 9
    <ec7>   DW_AT_decl_line   : 159
    <ec8>   DW_AT_decl_column : 19
    <ec9>   DW_AT_type        : <0xbad>
    <ecd>   DW_AT_data_member_location: 44
 <2><ece>: Abbrev Number: 8 (DW_TAG_member)
    <ecf>   DW_AT_name        : (indirect string, offset: 0xd26be): Overrun
    <ed3>   DW_AT_decl_file   : 9
    <ed4>   DW_AT_decl_line   : 164
    <ed5>   DW_AT_decl_column : 12
    <ed6>   DW_AT_type        : <0x83f>
    <eda>   DW_AT_data_member_location: 48
 <2><edb>: Abbrev Number: 8 (DW_TAG_member)
    <edc>   DW_AT_name        : (indirect string, offset: 0xd26f2): OversamplingMode
    <ee0>   DW_AT_decl_file   : 9
    <ee1>   DW_AT_decl_line   : 175
    <ee2>   DW_AT_decl_column : 19
    <ee3>   DW_AT_type        : <0xbad>
    <ee7>   DW_AT_data_member_location: 52
 <2><ee8>: Abbrev Number: 8 (DW_TAG_member)
    <ee9>   DW_AT_name        : (indirect string, offset: 0xd265c): Oversampling
    <eed>   DW_AT_decl_file   : 9
    <eee>   DW_AT_decl_line   : 179
    <eef>   DW_AT_decl_column : 27
    <ef0>   DW_AT_type        : <0xe10>
    <ef4>   DW_AT_data_member_location: 56
 <2><ef5>: Abbrev Number: 0
 <1><ef6>: Abbrev Number: 3 (DW_TAG_typedef)
    <ef7>   DW_AT_name        : (indirect string, offset: 0xd25f6): ADC_InitTypeDef
    <efb>   DW_AT_decl_file   : 9
    <efc>   DW_AT_decl_line   : 188
    <efd>   DW_AT_decl_column : 3
    <efe>   DW_AT_type        : <0xe1c>
 <1><f02>: Abbrev Number: 11 (DW_TAG_structure_type)
    <f03>   DW_AT_byte_size   : 8
    <f04>   DW_AT_decl_file   : 9
    <f05>   DW_AT_decl_line   : 299
    <f07>   DW_AT_decl_column : 9
    <f08>   DW_AT_sibling     : <0xf29>
 <2><f0c>: Abbrev Number: 13 (DW_TAG_member)
    <f0d>   DW_AT_name        : (indirect string, offset: 0xd264f): ContextQueue
    <f11>   DW_AT_decl_file   : 9
    <f12>   DW_AT_decl_line   : 301
    <f14>   DW_AT_decl_column : 12
    <f15>   DW_AT_type        : <0x83f>
    <f19>   DW_AT_data_member_location: 0
 <2><f1a>: Abbrev Number: 13 (DW_TAG_member)
    <f1b>   DW_AT_name        : (indirect string, offset: 0xd284b): ChannelCount
    <f1f>   DW_AT_decl_file   : 9
    <f20>   DW_AT_decl_line   : 305
    <f22>   DW_AT_decl_column : 12
    <f23>   DW_AT_type        : <0x83f>
    <f27>   DW_AT_data_member_location: 4
 <2><f28>: Abbrev Number: 0
 <1><f29>: Abbrev Number: 14 (DW_TAG_typedef)
    <f2a>   DW_AT_name        : (indirect string, offset: 0xd2762): ADC_InjectionConfigTypeDef
    <f2e>   DW_AT_decl_file   : 9
    <f2f>   DW_AT_decl_line   : 306
    <f31>   DW_AT_decl_column : 3
    <f32>   DW_AT_type        : <0xf02>
 <1><f36>: Abbrev Number: 11 (DW_TAG_structure_type)
    <f37>   DW_AT_byte_size   : 100
    <f38>   DW_AT_decl_file   : 9
    <f39>   DW_AT_decl_line   : 362
    <f3b>   DW_AT_decl_column : 9
    <f3c>   DW_AT_sibling     : <0xfa3>
 <2><f40>: Abbrev Number: 13 (DW_TAG_member)
    <f41>   DW_AT_name        : (indirect string, offset: 0xaaf8c): Instance
    <f45>   DW_AT_decl_file   : 9
    <f46>   DW_AT_decl_line   : 365
    <f48>   DW_AT_decl_column : 34
    <f49>   DW_AT_type        : <0xfa3>
    <f4d>   DW_AT_data_member_location: 0
 <2><f4e>: Abbrev Number: 13 (DW_TAG_member)
    <f4f>   DW_AT_name        : (indirect string, offset: 0xdc3cc): Init
    <f53>   DW_AT_decl_file   : 9
    <f54>   DW_AT_decl_line   : 366
    <f56>   DW_AT_decl_column : 33
    <f57>   DW_AT_type        : <0xef6>
    <f5b>   DW_AT_data_member_location: 4
 <2><f5c>: Abbrev Number: 13 (DW_TAG_member)
    <f5d>   DW_AT_name        : (indirect string, offset: 0xd2729): DMA_Handle
    <f61>   DW_AT_decl_file   : 9
    <f62>   DW_AT_decl_line   : 367
    <f64>   DW_AT_decl_column : 34
    <f65>   DW_AT_type        : <0xfa9>
    <f69>   DW_AT_data_member_location: 76
 <2><f6a>: Abbrev Number: 13 (DW_TAG_member)
    <f6b>   DW_AT_name        : (indirect string, offset: 0x95373): Lock
    <f6f>   DW_AT_decl_file   : 9
    <f70>   DW_AT_decl_line   : 368
    <f72>   DW_AT_decl_column : 33
    <f73>   DW_AT_type        : <0xc0e>
    <f77>   DW_AT_data_member_location: 80
 <2><f78>: Abbrev Number: 13 (DW_TAG_member)
    <f79>   DW_AT_name        : (indirect string, offset: 0xd9131): State
    <f7d>   DW_AT_decl_file   : 9
    <f7e>   DW_AT_decl_line   : 369
    <f80>   DW_AT_decl_column : 33
    <f81>   DW_AT_type        : <0x84b>
    <f85>   DW_AT_data_member_location: 84
 <2><f86>: Abbrev Number: 13 (DW_TAG_member)
    <f87>   DW_AT_name        : (indirect string, offset: 0xcd034): ErrorCode
    <f8b>   DW_AT_decl_file   : 9
    <f8c>   DW_AT_decl_line   : 370
    <f8e>   DW_AT_decl_column : 33
    <f8f>   DW_AT_type        : <0x84b>
    <f93>   DW_AT_data_member_location: 88
 <2><f94>: Abbrev Number: 13 (DW_TAG_member)
    <f95>   DW_AT_name        : (indirect string, offset: 0xd2596): InjectionConfig
    <f99>   DW_AT_decl_file   : 9
    <f9a>   DW_AT_decl_line   : 371
    <f9c>   DW_AT_decl_column : 33
    <f9d>   DW_AT_type        : <0xf29>
    <fa1>   DW_AT_data_member_location: 92
 <2><fa2>: Abbrev Number: 0
 <1><fa3>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <fa4>   DW_AT_byte_size   : 4
    <fa5>   DW_AT_type        : <0xa49>
 <1><fa9>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <faa>   DW_AT_byte_size   : 4
    <fab>   DW_AT_type        : <0xdc6>
 <1><faf>: Abbrev Number: 14 (DW_TAG_typedef)
    <fb0>   DW_AT_name        : (indirect string, offset: 0xd25a6): ADC_HandleTypeDef
    <fb4>   DW_AT_decl_file   : 9
    <fb5>   DW_AT_decl_line   : 385
    <fb7>   DW_AT_decl_column : 3
    <fb8>   DW_AT_type        : <0xf36>
 <1><fbc>: Abbrev Number: 9 (DW_TAG_array_type)
    <fbd>   DW_AT_type        : <0x833>
    <fc1>   DW_AT_sibling     : <0xfcc>
 <2><fc5>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <fc6>   DW_AT_type        : <0x82c>
    <fca>   DW_AT_upper_bound : 4
 <2><fcb>: Abbrev Number: 0
 <1><fcc>: Abbrev Number: 22 (DW_TAG_variable)
    <fcd>   DW_AT_name        : (indirect string, offset: 0xd2669): g_ADCBuffer
    <fd1>   DW_AT_decl_file   : 10
    <fd2>   DW_AT_decl_line   : 13
    <fd3>   DW_AT_decl_column : 17
    <fd4>   DW_AT_type        : <0xfbc>
    <fd8>   DW_AT_external    : 1
    <fd8>   DW_AT_declaration : 1
 <1><fd8>: Abbrev Number: 22 (DW_TAG_variable)
    <fd9>   DW_AT_name        : (indirect string, offset: 0xd2606): sensor_mode
    <fdd>   DW_AT_decl_file   : 10
    <fde>   DW_AT_decl_line   : 14
    <fdf>   DW_AT_decl_column : 13
    <fe0>   DW_AT_type        : <0xfe4>
    <fe4>   DW_AT_external    : 1
    <fe4>   DW_AT_declaration : 1
 <1><fe4>: Abbrev Number: 2 (DW_TAG_base_type)
    <fe5>   DW_AT_byte_size   : 1
    <fe6>   DW_AT_encoding    : 8	(unsigned char)
    <fe7>   DW_AT_name        : (indirect string, offset: 0x6905b): char
 <1><feb>: Abbrev Number: 9 (DW_TAG_array_type)
    <fec>   DW_AT_type        : <0x833>
    <ff0>   DW_AT_sibling     : <0xffb>
 <2><ff4>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <ff5>   DW_AT_type        : <0x82c>
    <ff9>   DW_AT_upper_bound : 3
 <2><ffa>: Abbrev Number: 0
 <1><ffb>: Abbrev Number: 22 (DW_TAG_variable)
    <ffc>   DW_AT_name        : (indirect string, offset: 0xd2675): g_sensor_on
    <1000>   DW_AT_decl_file   : 10
    <1001>   DW_AT_decl_line   : 16
    <1002>   DW_AT_decl_column : 17
    <1003>   DW_AT_type        : <0xfeb>
    <1007>   DW_AT_external    : 1
    <1007>   DW_AT_declaration : 1
 <1><1007>: Abbrev Number: 22 (DW_TAG_variable)
    <1008>   DW_AT_name        : (indirect string, offset: 0xd26a0): g_sensor_off
    <100c>   DW_AT_decl_file   : 10
    <100d>   DW_AT_decl_line   : 17
    <100e>   DW_AT_decl_column : 17
    <100f>   DW_AT_type        : <0xfeb>
    <1013>   DW_AT_external    : 1
    <1013>   DW_AT_declaration : 1
 <1><1013>: Abbrev Number: 22 (DW_TAG_variable)
    <1014>   DW_AT_name        : (indirect string, offset: 0xd253b): g_V_batt
    <1018>   DW_AT_decl_file   : 10
    <1019>   DW_AT_decl_line   : 21
    <101a>   DW_AT_decl_column : 14
    <101b>   DW_AT_type        : <0x101f>
    <101f>   DW_AT_external    : 1
    <101f>   DW_AT_declaration : 1
 <1><101f>: Abbrev Number: 2 (DW_TAG_base_type)
    <1020>   DW_AT_byte_size   : 4
    <1021>   DW_AT_encoding    : 4	(float)
    <1022>   DW_AT_name        : (indirect string, offset: 0xd262c): float
 <1><1026>: Abbrev Number: 22 (DW_TAG_variable)
    <1027>   DW_AT_name        : (indirect string, offset: 0xd2681): hadc1
    <102b>   DW_AT_decl_file   : 11
    <102c>   DW_AT_decl_line   : 35
    <102d>   DW_AT_decl_column : 26
    <102e>   DW_AT_type        : <0xfaf>
    <1032>   DW_AT_external    : 1
    <1032>   DW_AT_declaration : 1
 <1><1032>: Abbrev Number: 23 (DW_TAG_variable)
    <1033>   DW_AT_specification: <0xfcc>
    <1037>   DW_AT_decl_file   : 1
    <1038>   DW_AT_decl_line   : 16
    <1039>   DW_AT_decl_column : 10
    <103a>   DW_AT_location    : 5 byte block: 3 f8 1 0 20 	(DW_OP_addr: 200001f8)
 <1><1040>: Abbrev Number: 24 (DW_TAG_variable)
    <1041>   DW_AT_name        : (indirect string, offset: 0xd25ee): AD_step
    <1045>   DW_AT_decl_file   : 1
    <1046>   DW_AT_decl_line   : 17
    <1047>   DW_AT_decl_column : 6
